{
  "vocab": {
    "__UNK__": 0,
    "6g6f": 1,
    "8g8f": 2,
    "4g4f": 3,
    "3g3f": 4,
    "2i3g": 5,
    "3f3e": 6,
    "7f7e": 7,
    "4f4e": 8,
    "2e2d": 9,
    "6f6e": 10,
    "8i7g": 11,
    "5f5e": 12,
    "5g5f": 13,
    "9g9f": 14,
    "1g1f": 15,
    "7i8h": 16,
    "4i5h": 17,
    "8h7g": 18,
    "3g4e": 19,
    "7g7f": 20,
    "3e3d": 21,
    "7g6f": 22,
    "4g5f": 23,
    "4e4d": 24,
    "1f1e": 25,
    "9f9e": 26,
    "5h6g": 27,
    "7e7d": 28,
    "5i6h": 29,
    "2g2f": 30,
    "P*8g": 31,
    "5e5d": 32,
    "6i7h": 33,
    "8f8e": 34,
    "7i6h": 35,
    "7h8h": 36,
    "6e6d": 37,
    "2f2e": 38,
    "4h4g": 39,
    "4i4h": 40,
    "7h7g": 41,
    "6i7i": 42,
    "7g8f": 43,
    "P*2d": 44,
    "6h7i": 45,
    "2h2d": 46,
    "6h7g": 47,
    "3d3c+": 48,
    "7g6h": 49,
    "P*3d": 50,
    "7h8g": 51,
    "2h2i": 52,
    "6h6g": 53,
    "7d7c+": 54,
    "5h6h": 55,
    "4h5g": 56,
    "3h4g": 57,
    "6h5g": 58,
    "P*7d": 59,
    "5h4g": 60,
    "8h7i": 61,
    "4i3h": 62,
    "P*2e": 63,
    "7g6e": 64,
    "7h6g": 65,
    "5g4f": 66,
    "8h8g": 67,
    "6g5f": 68,
    "6h7h": 69,
    "3g4f": 70,
    "5i6i": 71,
    "2d2c+": 72,
    "3g2e": 73,
    "P*4d": 74,
    "4h3g": 75,
    "P*2c": 76,
    "5g6f": 77,
    "9i9h": 78,
    "2h3h": 79,
    "4d4c+": 80,
    "3i3h": 81,
    "4f3e": 82,
    "7i7h": 83,
    "7h6h": 84,
    "6i5h": 85,
    "P*2b": 86,
    "3h3g": 87,
    "5f4e": 88,
    "P*3c": 89,
    "5d5c+": 90,
    "6i6h": 91,
    "5h4h": 92,
    "5h5g": 93,
    "3i2h": 94,
    "8e8d": 95,
    "6g7f": 96,
    "P*3e": 97,
    "P*6d": 98,
    "6d6c+": 99,
    "P*5d": 100,
    "6f5e": 101,
    "P*5c": 102,
    "P*4e": 103,
    "8h9g": 104,
    "4f5e": 105,
    "3i4h": 106,
    "P*7f": 107,
    "7g8h": 108,
    "1e1d": 109,
    "3h2g": 110,
    "2h2f": 111,
    "5f6e": 112,
    "P*7e": 113,
    "6h5h": 114,
    "6f7g": 115,
    "7g8e": 116,
    "P*5e": 117,
    "2h2g": 118,
    "4e3c+": 119,
    "4g3f": 120,
    "5i4h": 121,
    "B*6f": 122,
    "5f6g": 123,
    "4h3h": 124,
    "6f7e": 125,
    "5i5h": 126,
    "9e9d": 127,
    "P*4c": 128,
    "3h2h": 129,
    "3g2f": 130,
    "8h9i": 131,
    "P*4f": 132,
    "2h4h": 133,
    "P*1c": 134,
    "P*6f": 135,
    "1i1h": 136,
    "6f5g": 137,
    "P*6c": 138,
    "8h7h": 139,
    "N*5e": 140,
    "P*5f": 141,
    "P*8d": 142,
    "P*3f": 143,
    "N*4e": 144,
    "P*8e": 145,
    "P*6e": 146,
    "4h5h": 147,
    "P*8f": 148,
    "4i3i": 149,
    "2d2h": 150,
    "5f4g": 151,
    "P*7g": 152,
    "2f3f": 153,
    "P*8c": 154,
    "8i9g": 155,
    "5g6h": 156,
    "4e5c+": 157,
    "B*4f": 158,
    "1d1c+": 159,
    "7h7i": 160,
    "2e3c+": 161,
    "4f3g": 162,
    "B*5e": 163,
    "6g7g": 164,
    "N*4d": 165,
    "P*7c": 166,
    "8d8c+": 167,
    "P*1d": 168,
    "2h5h": 169,
    "2h1h": 170,
    "2i2d": 171,
    "2b2a+": 172,
    "2d2i": 173,
    "4f5g": 174,
    "N*3d": 175,
    "4h3i": 176,
    "6h6i": 177,
    "B*5f": 178,
    "6g6h": 179,
    "5e6d": 180,
    "9h9g": 181,
    "N*2e": 182,
    "P*8h": 183,
    "B*4a": 184,
    "7g5i": 185,
    "B*7a": 186,
    "3f2f": 187,
    "S*4c": 188,
    "2d3d": 189,
    "8g7f": 190,
    "5e4d": 191,
    "3h4h": 192,
    "6h5i": 193,
    "P*3g": 194,
    "5h5i": 195,
    "R*8b": 196,
    "9d9c+": 197,
    "S*5c": 198,
    "R*4a": 199,
    "P*2f": 200,
    "8h6f": 201,
    "6g5g": 202,
    "8f7g": 203,
    "8f7e": 204,
    "N*3e": 205,
    "2d2f": 206,
    "S*5b": 207,
    "2i1g": 208,
    "S*4a": 209,
    "N*7e": 210,
    "4e3d": 211,
    "3e4f": 212,
    "P*8b": 213,
    "2f3e": 214,
    "2c2b+": 215,
    "N*6e": 216,
    "P*6h": 217,
    "9i9g": 218,
    "N*5f": 219,
    "4i5i": 220,
    "5e6f": 221,
    "R*6a": 222,
    "7g7h": 223,
    "P*6g": 224,
    "N*4f": 225,
    "R*7a": 226,
    "1i1e": 227,
    "6e5c+": 228,
    "8h9h": 229,
    "5c5b+": 230,
    "6g5h": 231,
    "6h4f": 232,
    "8h2b+": 233,
    "B*7g": 234,
    "P*5h": 235,
    "7c6c": 236,
    "4e5f": 237,
    "P*9c": 238,
    "N*6d": 239,
    "S*6c": 240,
    "3e2d": 241,
    "5e4f": 242,
    "6i5i": 243,
    "P*7b": 244,
    "7h6i": 245,
    "R*8a": 246,
    "B*6a": 247,
    "1i1g": 248,
    "N*5d": 249,
    "7f6e": 250,
    "P*2g": 251,
    "7f6g": 252,
    "7g6g": 253,
    "N*7d": 254,
    "N*2f": 255,
    "P*4g": 256,
    "8b8a+": 257,
    "2g3f": 258,
    "2h3g": 259,
    "3e4d": 260,
    "4h4i": 261,
    "5g4h": 262,
    "2a1a": 263,
    "2d2e": 264,
    "2f2h": 265,
    "P*1b": 266,
    "2f2d": 267,
    "2i2h": 268,
    "7i4f": 269,
    "G*4c": 270,
    "5i4i": 271,
    "N*6f": 272,
    "N*8e": 273,
    "P*9d": 274,
    "P*4h": 275,
    "3h3i": 276,
    "B*5a": 277,
    "6g7h": 278,
    "7f8e": 279,
    "3c4c": 280,
    "2c3b": 281,
    "4g4h": 282,
    "8e7c+": 283,
    "S*4b": 284,
    "2f2i": 285,
    "2h2e": 286,
    "S*3b": 287,
    "S*3c": 288,
    "3g4h": 289,
    "5c4c": 290,
    "R*3a": 291,
    "P*2h": 292,
    "4c4b+": 293,
    "7i6i": 294,
    "P*5g": 295,
    "R*2a": 296,
    "6e7d": 297,
    "P*5i": 298,
    "3f4e": 299,
    "P*4b": 300,
    "3d3e": 301,
    "4g5h": 302,
    "8h3c+": 303,
    "B*3a": 304,
    "6e7c+": 305,
    "3f4g": 306,
    "G*6b": 307,
    "8g7h": 308,
    "G*4b": 309,
    "S*3a": 310,
    "S*7h": 311,
    "2h3i": 312,
    "7e6d": 313,
    "S*3d": 314,
    "3c3b+": 315,
    "B*8c": 316,
    "G*3b": 317,
    "N*3f": 318,
    "S*7a": 319,
    "5h6i": 320,
    "B*5c": 321,
    "S*7b": 322,
    "B*6c": 323,
    "7e6f": 324,
    "4e5d": 325,
    "6c5c": 326,
    "6c6b+": 327,
    "P*5b": 328,
    "P*6b": 329,
    "S*2c": 330,
    "4g3h": 331,
    "R*5a": 332,
    "1h1g": 333,
    "4f6d": 334,
    "9g8f": 335,
    "6e5d": 336,
    "2f3g": 337,
    "S*7c": 338,
    "2h1i": 339,
    "P*6i": 340,
    "2c3c": 341,
    "7g5e": 342,
    "8a9a": 343,
    "B*7b": 344,
    "P*7h": 345,
    "5c4b": 346,
    "1a2a": 347,
    "7g8g": 348,
    "9i9e": 349,
    "B*2b": 350,
    "7g3c+": 351,
    "B*6e": 352,
    "B*8b": 353,
    "S*5e": 354,
    "2i6i": 355,
    "5b4b": 356,
    "S*6b": 357,
    "6c5b": 358,
    "B*4d": 359,
    "6e5f": 360,
    "S*6a": 361,
    "B*6d": 362,
    "S*8c": 363,
    "2h1g": 364,
    "P*7i": 365,
    "S*5f": 366,
    "5g6g": 367,
    "4a3b+": 368,
    "P*9b": 369,
    "5g5h": 370,
    "G*5c": 371,
    "G*5b": 372,
    "P*3b": 373,
    "5h4i": 374,
    "B*4c": 375,
    "P*9h": 376,
    "2e1c+": 377,
    "3f2e": 378,
    "4g5g": 379,
    "9g8h": 380,
    "S*6g": 381,
    "8g7g": 382,
    "3h3e": 383,
    "S*2b": 384,
    "2h6h": 385,
    "S*4d": 386,
    "S*7g": 387,
    "7i8i": 388,
    "P*3h": 389,
    "2b3b": 390,
    "7e8d": 391,
    "N*2d": 392,
    "5c5b": 393,
    "6b5b": 394,
    "6f4d": 395,
    "7f6f": 396,
    "2i3i": 397,
    "N*8d": 398,
    "3e2f": 399,
    "7f8g": 400,
    "8h5e": 401,
    "G*6c": 402,
    "2e2i": 403,
    "8h8i": 404,
    "G*7b": 405,
    "4c3b": 406,
    "4h5i": 407,
    "2i2f": 408,
    "3b4b": 409,
    "5f6f": 410,
    "2i5i": 411,
    "4g3g": 412,
    "8g9f": 413,
    "G*7h": 414,
    "5g4g": 415,
    "6f6g": 416,
    "G*6h": 417,
    "R*2b": 418,
    "S*4e": 419,
    "S*7e": 420,
    "7f8f": 421,
    "N*8f": 422,
    "P*4i": 423,
    "2a3a": 424,
    "3c4b": 425,
    "7e8f": 426,
    "7h8i": 427,
    "6h3e": 428,
    "B*7c": 429,
    "N*7f": 430,
    "P*9f": 431,
    "S*6h": 432,
    "S*8b": 433,
    "5c6c": 434,
    "P*3i": 435,
    "3h4i": 436,
    "4b5b": 437,
    "4c5c": 438,
    "6e7f": 439,
    "B*7e": 440,
    "G*7i": 441,
    "6f7f": 442,
    "G*3d": 443,
    "S*6f": 444,
    "3e3f": 445,
    "4c5b": 446,
    "S*3e": 447,
    "1a1b": 448,
    "2b1a": 449,
    "5c6b": 450,
    "B*3g": 451,
    "2g3h": 452,
    "3c3b": 453,
    "6f5f": 454,
    "7c6b": 455,
    "S*5h": 456,
    "3i4i": 457,
    "5f4f": 458,
    "7b6b": 459,
    "B*7d": 460,
    "3h3f": 461,
    "S*4f": 462,
    "4b3b": 463,
    "7c7b+": 464,
    "B*4e": 465,
    "2g2h": 466,
    "S*5a": 467,
    "2f1e": 468,
    "8b7b": 469,
    "L*5f": 470,
    "8f9g": 471,
    "B*3d": 472,
    "2a2b": 473,
    "2c2b": 474,
    "4a4b": 475,
    "3g2h": 476,
    "4c4b": 477,
    "5i2f": 478,
    "6b7b": 479,
    "7c7b": 480,
    "7g4d": 481,
    "7h7f": 482,
    "L*8f": 483,
    "S*6d": 484,
    "S*7d": 485,
    "5i3g": 486,
    "P*1e": 487,
    "S*5d": 488,
    "S*8h": 489,
    "4d3b+": 490,
    "2f5f": 491,
    "4c3c": 492,
    "8g8h": 493,
    "L*5i": 494,
    "3b3c": 495,
    "B*2f": 496,
    "B*5d": 497,
    "G*3c": 498,
    "2i2e": 499,
    "3f4f": 500,
    "4f6h": 501,
    "5e6c+": 502,
    "6d5e": 503,
    "7i5g": 504,
    "G*2b": 505,
    "R*7b": 506,
    "1g2e": 507,
    "2e3d": 508,
    "6c7c": 509,
    "8f9e": 510,
    "P*9g": 511,
    "4e3f": 512,
    "5h5f": 513,
    "9i9f": 514,
    "9g8e": 515,
    "2f2g": 516,
    "3d4d": 517,
    "4d3c+": 518,
    "3g3h": 519,
    "4f5f": 520,
    "5b6b": 521,
    "7c8b": 522,
    "3h2i": 523,
    "7d7e": 524,
    "9a8a": 525,
    "P*1h": 526,
    "7f7g": 527,
    "S*7f": 528,
    "8e7d": 529,
    "9i8h": 530,
    "B*3c": 531,
    "N*6h": 532,
    "S*3h": 533,
    "4b4c": 534,
    "5b6a": 535,
    "8f7f": 536,
    "L*4f": 537,
    "R*3b": 538,
    "3d3f": 539,
    "3d4b+": 540,
    "5e4c+": 541,
    "7b7a+": 542,
    "B*6b": 543,
    "2i4i": 544,
    "G*8b": 545,
    "N*3g": 546,
    "7i3e": 547,
    "R*4b": 548,
    "6c6d": 549,
    "6h8f": 550,
    "8h4d": 551,
    "L*4i": 552,
    "N*7g": 553,
    "R*5b": 554,
    "S*6e": 555,
    "2e2f": 556,
    "3i2i": 557,
    "5f5g": 558,
    "L*6f": 559,
    "N*3c": 560,
    "S*4h": 561,
    "5c5d": 562,
    "N*4g": 563,
    "4h2h": 564,
    "6c6b": 565,
    "8e9c+": 566,
    "6c7b": 567,
    "B*5b": 568,
    "G*4h": 569,
    "N*5g": 570,
    "2f3d": 571,
    "B*1f": 572,
    "G*3i": 573,
    "G*5h": 574,
    "S*8g": 575,
    "2i2g": 576,
    "7i2d": 577,
    "G*2c": 578,
    "L*4d": 579,
    "P*9e": 580,
    "3d2b+": 581,
    "3f2g": 582,
    "G*7c": 583,
    "4f3f": 584,
    "B*3b": 585,
    "1i1f": 586,
    "2d2a+": 587,
    "3g4g": 588,
    "8c8b+": 589,
    "8g9h": 590,
    "4c4d": 591,
    "6a7b+": 592,
    "7a6b+": 593,
    "7c7d": 594,
    "G*7g": 595,
    "G*8h": 596,
    "N*1e": 597,
    "3d2c+": 598,
    "4f2d": 599,
    "5h5e": 600,
    "G*4d": 601,
    "N*5c": 602,
    "R*6b": 603,
    "S*3g": 604,
    "3a3b": 605,
    "3d4c": 606,
    "6h2d": 607,
    "7b8a": 608,
    "7g2b+": 609,
    "8c7b": 610,
    "B*2c": 611,
    "S*4g": 612,
    "6a6b": 613,
    "8c7c": 614,
    "B*8d": 615,
    "1c1b+": 616,
    "2c2d": 617,
    "2d4f": 618,
    "6b6c": 619,
    "7d6d": 620,
    "G*3h": 621,
    "L*5e": 622,
    "2e2h": 623,
    "3d3c": 624,
    "4a3a": 625,
    "5e5f": 626,
    "S*2e": 627,
    "4h4f": 628,
    "5b4a": 629,
    "6f8d": 630,
    "B*4b": 631,
    "2f1f": 632,
    "5b5c": 633,
    "5h5d": 634,
    "8i8h": 635,
    "L*2f": 636,
    "N*7i": 637,
    "5b5a+": 638,
    "7e7f": 639,
    "8b9a": 640,
    "L*3i": 641,
    "3e2e": 642,
    "4d5c+": 643,
    "6d7e": 644,
    "2g3g": 645,
    "4h4e": 646,
    "5f3d": 647,
    "6b6a+": 648,
    "8e7f": 649,
    "G*3e": 650,
    "G*4e": 651,
    "3d4e": 652,
    "3f5f": 653,
    "6d7c+": 654,
    "G*5d": 655,
    "L*3d": 656,
    "N*6i": 657,
    "8b9a+": 658,
    "G*7d": 659,
    "L*8d": 660,
    "6b6a": 661,
    "6e6f": 662,
    "6f3c+": 663,
    "B*2a": 664,
    "2d2b+": 665,
    "3d2d": 666,
    "4f3d": 667,
    "B*6g": 668,
    "S*5g": 669,
    "2e3e": 670,
    "2i8i": 671,
    "B*3e": 672,
    "G*6i": 673,
    "N*8c": 674,
    "S*3f": 675,
    "S*8f": 676,
    "3f3d": 677,
    "7d6c+": 678,
    "7d6e": 679,
    "8f6d": 680,
    "B*1e": 681,
    "B*5g": 682,
    "G*4a": 683,
    "P*1f": 684,
    "4f4g": 685,
    "8c8b": 686,
    "S*8d": 687,
    "2b2c": 688,
    "7d6c": 689,
    "G*8c": 690,
    "P*2i": 691,
    "7a8a": 692,
    "8i7h": 693,
    "B*9e": 694,
    "N*4c": 695,
    "N*5i": 696,
    "N*6g": 697,
    "S*2f": 698,
    "S*7i": 699,
    "3c3d": 700,
    "G*7e": 701,
    "7b7c": 702,
    "8e8f": 703,
    "B*8f": 704,
    "2b1a+": 705,
    "3d4c+": 706,
    "3g2g": 707,
    "4d5e": 708,
    "5e7g": 709,
    "6a7a": 710,
    "G*5i": 711,
    "2d3c+": 712,
    "3a2a": 713,
    "5f4d": 714,
    "7d7c": 715,
    "B*4g": 716,
    "G*6g": 717,
    "L*3c": 718,
    "L*5h": 719,
    "N*4h": 720,
    "N*5h": 721,
    "2f4f": 722,
    "3a4a": 723,
    "5a6a": 724,
    "6d6e": 725,
    "7e6c+": 726,
    "8f8g": 727,
    "9h8g": 728,
    "L*7i": 729,
    "1c2c": 730,
    "1i1d": 731,
    "3b3a+": 732,
    "6d5d": 733,
    "3b2a": 734,
    "4b3a": 735,
    "5a5b": 736,
    "7d7f": 737,
    "G*4i": 738,
    "1h2h": 739,
    "4b4a+": 740,
    "4d5b+": 741,
    "6d5c+": 742,
    "8i7i": 743,
    "9e8d": 744,
    "B*1h": 745,
    "1b2a": 746,
    "1e2d": 747,
    "2a3b": 748,
    "2b2a": 749,
    "2f7f": 750,
    "2g2d": 751,
    "6d7b+": 752,
    "7g9e": 753,
    "8c7d+": 754,
    "8d7c+": 755,
    "G*3a": 756,
    "L*6d": 757,
    "3f3g": 758,
    "4e4f": 759,
    "6d5c": 760,
    "B*9f": 761,
    "L*2i": 762,
    "2f4d": 763,
    "3b3a": 764,
    "5d4b+": 765,
    "5f6d": 766,
    "6a5b+": 767,
    "6c7d+": 768,
    "9a9b": 769,
    "9c8c": 770,
    "9h8h": 771,
    "L*3e": 772,
    "L*8e": 773,
    "1b1a+": 774,
    "4a3b": 775,
    "8a7a": 776,
    "B*7f": 777,
    "L*4e": 778,
    "L*6i": 779,
    "5a4a": 780,
    "5f5d": 781,
    "6d7c": 782,
    "6h6f": 783,
    "7a7b": 784,
    "8h6h": 785,
    "G*5e": 786,
    "S*2h": 787,
    "S*8e": 788,
    "2h2c+": 789,
    "4a5b+": 790,
    "5d6d": 791,
    "6b5a": 792,
    "6d6c": 793,
    "7a8b+": 794,
    "2h7h": 795,
    "3e6h": 796,
    "6f8h": 797,
    "8b8a": 798,
    "8f6h": 799,
    "B*3f": 800,
    "G*6d": 801,
    "3b4a": 802,
    "3e4c+": 803,
    "4a6c+": 804,
    "7c8c": 805,
    "L*4g": 806,
    "R*1b": 807,
    "2d3e": 808,
    "4d3c": 809,
    "6b7a": 810,
    "6h8h": 811,
    "7f7d": 812,
    "7h7d": 813,
    "9i8i": 814,
    "G*6f": 815,
    "L*6h": 816,
    "N*3h": 817,
    "S*6i": 818,
    "4f5d": 819,
    "5a4b+": 820,
    "5h2h": 821,
    "5i5f": 822,
    "6d5b+": 823,
    "6f1a+": 824,
    "6f5d": 825,
    "7e8e": 826,
    "G*4f": 827,
    "L*4h": 828,
    "2e3f": 829,
    "2f2c+": 830,
    "2g1f": 831,
    "4a5a": 832,
    "5d6b+": 833,
    "5f5i": 834,
    "7a5c+": 835,
    "1a2b": 836,
    "4b5a": 837,
    "5b4c+": 838,
    "5g7e": 839,
    "5i5e": 840,
    "7e6e": 841,
    "8a8b": 842,
    "8h8d": 843,
    "9a8b": 844,
    "L*3f": 845,
    "3d2e": 846,
    "3e2c+": 847,
    "3f4d": 848,
    "5e1a+": 849,
    "5e3c+": 850,
    "6f2b+": 851,
    "7d8e": 852,
    "8d7d": 853,
    "8i9h": 854,
    "B*8h": 855,
    "R*9b": 856,
    "S*2a": 857,
    "5i2i": 858,
    "6i2i": 859,
    "7d6b+": 860,
    "9g7e": 861,
    "G*2d": 862,
    "G*6e": 863,
    "2i1i": 864,
    "3a2b+": 865,
    "3d2c": 866,
    "4d3e": 867,
    "4e5e": 868,
    "5d4d": 869,
    "5h7h": 870,
    "6a5a": 871,
    "6i6f": 872,
    "7g1a+": 873,
    "8g9g": 874,
    "B*2d": 875,
    "B*2g": 876,
    "B*8e": 877,
    "G*6a": 878,
    "N*6c": 879,
    "N*9d": 880,
    "1b2b": 881,
    "4d4c": 882,
    "5d6c": 883,
    "5d6e": 884,
    "9c9b+": 885,
    "G*5f": 886,
    "L*2g": 887,
    "S*2d": 888,
    "2f1g": 889,
    "3b2b": 890,
    "3g5e": 891,
    "4d5c": 892,
    "5d4e": 893,
    "1g2f": 894,
    "4c3b+": 895,
    "G*2f": 896,
    "N*2g": 897,
    "1h1e": 898,
    "2b3a": 899,
    "3a4b+": 900,
    "5e4e": 901,
    "G*8d": 902,
    "N*4i": 903,
    "N*7h": 904,
    "R*9a": 905,
    "4f7c+": 906,
    "5d5i": 907,
    "5e3g": 908,
    "5i7g": 909,
    "6d7d": 910,
    "9f8g": 911,
    "B*9g": 912,
    "L*7e": 913,
    "3c2c": 914,
    "4a5b": 915,
    "5f3f": 916,
    "6d4f": 917,
    "6f4h": 918,
    "8h8f": 919,
    "B*2e": 920,
    "N*7c": 921,
    "3e3h": 922,
    "3f2d": 923,
    "7h7e": 924,
    "8b7c+": 925,
    "B*8a": 926,
    "L*7g": 927,
    "N*9e": 928,
    "R*8c": 929,
    "2d2g": 930,
    "3e4e": 931,
    "3g6d": 932,
    "5b6c+": 933,
    "5d5e": 934,
    "5f2f": 935,
    "6e5e": 936,
    "6f7d": 937,
    "7b6c+": 938,
    "8f7d": 939,
    "9g6d": 940,
    "N*2c": 941,
    "5b5a": 942,
    "5d5c": 943,
    "6a5b": 944,
    "8c8d": 945,
    "8d7b+": 946,
    "8d7c": 947,
    "B*6h": 948,
    "P*1g": 949,
    "5e5i": 950,
    "6f6d": 951,
    "7a6a": 952,
    "B*5h": 953,
    "G*3g": 954,
    "G*4g": 955,
    "2d3b+": 956,
    "3a4b": 957,
    "3h5h": 958,
    "4b4a": 959,
    "5d4c": 960,
    "5d4c+": 961,
    "5f7d": 962,
    "6a7b": 963,
    "7b7a": 964,
    "7d8d": 965,
    "8a9a+": 966,
    "9h8i": 967,
    "S*1c": 968,
    "1e1c+": 969,
    "1g2h": 970,
    "2d7d": 971,
    "2e2c+": 972,
    "2f6f": 973,
    "4d6f": 974,
    "7b8b": 975,
    "7d8c": 976,
    "8b7a": 977,
    "G*3f": 978,
    "L*1i": 979,
    "L*6e": 980,
    "N*1d": 981,
    "N*3i": 982,
    "2i2c+": 983,
    "5g3e": 984,
    "5g8d": 985,
    "7b8c+": 986,
    "7f5f": 987,
    "8a7b": 988,
    "8d7e": 989,
    "9c8b": 990,
    "9e8f": 991,
    "9g8g": 992,
    "B*3h": 993,
    "G*2e": 994,
    "L*5g": 995,
    "S*2g": 996,
    "1c2b": 997,
    "2a1a+": 998,
    "2b3c+": 999,
    "3c2b": 1000,
    "5e6e": 1001,
    "6e7e": 1002,
    "9f8e": 1003,
    "B*1g": 1004,
    "L*4c": 1005,
    "L*7f": 1006,
    "L*8g": 1007,
    "R*5c": 1008,
    "S*5i": 1009,
    "1i1c+": 1010,
    "4d1a+": 1011,
    "4e3e": 1012,
    "5a4b": 1013,
    "5h3h": 1014,
    "5i5g": 1015,
    "7a8a+": 1016,
    "7a8b": 1017,
    "7b6a": 1018,
    "7d8c+": 1019,
    "7e5c+": 1020,
    "L*9i": 1021,
    "N*8i": 1022,
    "S*4i": 1023,
    "1f2f": 1024,
    "2d2c": 1025,
    "2e4e": 1026,
    "3e5g": 1027,
    "4f4d": 1028,
    "4h4d": 1029,
    "4i4f": 1030,
    "5c6d": 1031,
    "5d6c+": 1032,
    "6h6e": 1033,
    "7e8c+": 1034,
    "8d8c": 1035,
    "L*8h": 1036,
    "N*8h": 1037,
    "2a3b+": 1038,
    "3a2b": 1039,
    "3d5f": 1040,
    "4d5d": 1041,
    "4f9a+": 1042,
    "5c4d": 1043,
    "5e9a+": 1044,
    "5f7f": 1045,
    "6c7d": 1046,
    "8e9d": 1047,
    "9b8b": 1048,
    "G*8f": 1049,
    "L*2h": 1050,
    "N*2i": 1051,
    "R*1a": 1052,
    "2d6h": 1053,
    "2i7i": 1054,
    "4d3d": 1055,
    "5a6b": 1056,
    "5f5c+": 1057,
    "6i6g": 1058,
    "7h5h": 1059,
    "8d8e": 1060,
    "9i9d": 1061,
    "G*7a": 1062,
    "L*2e": 1063,
    "1e2f": 1064,
    "2c2a": 1065,
    "2c3d+": 1066,
    "2e8e": 1067,
    "2f8f": 1068,
    "2g2i": 1069,
    "4i2i": 1070,
    "4i4g": 1071,
    "5g2d": 1072,
    "6d9a+": 1073,
    "7b6c": 1074,
    "7b8a+": 1075,
    "8c9b": 1076,
    "B*4h": 1077,
    "1e2c+": 1078,
    "2c3d": 1079,
    "2d3c": 1080,
    "2g2e": 1081,
    "5a6b+": 1082,
    "8b7c": 1083,
    "8b8c": 1084,
    "8c7d": 1085,
    "N*1f": 1086,
    "1f2e": 1087,
    "2i3h": 1088,
    "5c6a+": 1089,
    "5e7c+": 1090,
    "5f8f": 1091,
    "5h8h": 1092,
    "6b5c+": 1093,
    "6d8f": 1094,
    "8f8d": 1095,
    "G*2h": 1096,
    "L*5c": 1097,
    "L*5d": 1098,
    "L*8i": 1099,
    "L*9h": 1100,
    "S*3i": 1101,
    "3i6i": 1102,
    "4d4e": 1103,
    "6c5d": 1104,
    "8e7e": 1105,
    "8f9f": 1106,
    "B*2h": 1107,
    "G*5g": 1108,
    "L*2d": 1109,
    "R*6c": 1110,
    "1a4d": 1111,
    "3d7d": 1112,
    "3f3i": 1113,
    "4c3d+": 1114,
    "4c5d+": 1115,
    "5c4b+": 1116,
    "6c5d+": 1117,
    "7c6d+": 1118,
    "7d8b+": 1119,
    "9a6d": 1120,
    "9h9f": 1121,
    "G*5a": 1122,
    "L*6g": 1123,
    "P*8i": 1124,
    "2c3b+": 1125,
    "2g1h": 1126,
    "3e3c+": 1127,
    "3f7f": 1128,
    "4b3c+": 1129,
    "5c4d+": 1130,
    "5c6d+": 1131,
    "8d6f": 1132,
    "8e9f": 1133,
    "9b8a": 1134,
    "9g9h": 1135,
    "L*6c": 1136,
    "L*7d": 1137,
    "3b2a+": 1138,
    "3d3b+": 1139,
    "3f8f": 1140,
    "3h3d": 1141,
    "4h6f": 1142,
    "6a4c+": 1143,
    "6a8a+": 1144,
    "8d9e": 1145,
    "B*1a": 1146,
    "G*8e": 1147,
    "S*9c": 1148,
    "1i2h": 1149,
    "2d4d": 1150,
    "2e1e": 1151,
    "3b4c": 1152,
    "3b4c+": 1153,
    "3h6h": 1154,
    "4a2c+": 1155,
    "4e5c": 1156,
    "6i6e": 1157,
    "7e2e": 1158,
    "7f6d": 1159,
    "G*8g": 1160,
    "L*8c": 1161,
    "R*2c": 1162,
    "1a3c": 1163,
    "2c1b": 1164,
    "2f5c+": 1165,
    "3f1f": 1166,
    "4e4c+": 1167,
    "5b4c": 1168,
    "B*9c": 1169,
    "L*7h": 1170,
    "4c3d": 1171,
    "6h6d": 1172,
    "G*8i": 1173,
    "L*9f": 1174,
    "2a4a": 1175,
    "2f1d": 1176,
    "3a2a+": 1177,
    "3e5c+": 1178,
    "4i4e": 1179,
    "5e5c+": 1180,
    "8h5h": 1181,
    "9c9b": 1182,
    "9e9c+": 1183,
    "9i9c+": 1184,
    "G*2i": 1185,
    "L*3h": 1186,
    "2b3c": 1187,
    "2h8h": 1188,
    "3b2c+": 1189,
    "3e8e": 1190,
    "4h6h": 1191,
    "6h4h": 1192,
    "8f5f": 1193,
    "8i9i": 1194,
    "G*2a": 1195,
    "L*1h": 1196,
    "L*3g": 1197,
    "1b1c": 1198,
    "2d1d": 1199,
    "2d4b+": 1200,
    "2e1d": 1201,
    "2e2g": 1202,
    "2g1g": 1203,
    "4f2f": 1204,
    "6c5b+": 1205,
    "6c7b+": 1206,
    "9b9a+": 1207,
    "S*1b": 1208,
    "4b5c": 1209,
    "4e4i": 1210,
    "5i5d": 1211,
    "6f6i": 1212,
    "7c6d": 1213,
    "7f3f": 1214,
    "8a6c": 1215,
    "8d8f": 1216,
    "R*8d": 1217,
    "1c1b": 1218,
    "1h4h": 1219,
    "1h5h": 1220,
    "3f6f": 1221,
    "3i3e": 1222,
    "3i3g": 1223,
    "4h1h": 1224,
    "5d5f": 1225,
    "5e8h": 1226,
    "5g3i": 1227,
    "5i8i": 1228,
    "6b5c": 1229,
    "6h9e": 1230,
    "7a6b": 1231,
    "8f5i": 1232,
    "8h1a+": 1233,
    "B*8g": 1234,
    "G*7f": 1235,
    "1g1e": 1236,
    "1i2i": 1237,
    "2e7e": 1238,
    "3a5c+": 1239,
    "3e3i": 1240,
    "3f3h": 1241,
    "3g5i": 1242,
    "4f4c+": 1243,
    "6c4a": 1244,
    "7a4d+": 1245,
    "7e5g": 1246,
    "7f2f": 1247,
    "8d8a+": 1248,
    "8f5c+": 1249,
    "9c9d": 1250,
    "9e7c+": 1251,
    "9g7i": 1252,
    "B*7h": 1253,
    "R*4c": 1254,
    "1a5e": 1255,
    "1b1a": 1256,
    "1f2g": 1257,
    "4b5c+": 1258,
    "5a7c+": 1259,
    "7d5f": 1260,
    "8e8c+": 1261,
    "8f8c+": 1262,
    "8i5i": 1263,
    "B*1b": 1264,
    "B*9h": 1265,
    "1g2g": 1266,
    "1h2g": 1267,
    "2i1h": 1268,
    "4h2f": 1269,
    "5g6e": 1270,
    "6d3g": 1271,
    "6e6c+": 1272,
    "6f6c+": 1273,
    "8c7b+": 1274,
    "9a7c": 1275,
    "N*2h": 1276,
    "1b2c": 1277,
    "1c1d": 1278,
    "1d1b+": 1279,
    "1e1f": 1280,
    "2d6d": 1281,
    "2e2a+": 1282,
    "3c4d": 1283,
    "3d5d": 1284,
    "4a2a+": 1285,
    "4c5d": 1286,
    "4f4i": 1287,
    "4g3e": 1288,
    "5i7i": 1289,
    "6f3i": 1290,
    "6f9c+": 1291,
    "7f8d": 1292,
    "8f4b+": 1293,
    "8i8f": 1294,
    "9a5e": 1295,
    "9f8f": 1296,
    "1e1a+": 1297,
    "2e3c": 1298,
    "2g4g": 1299,
    "3b2c": 1300,
    "3i5i": 1301,
    "4c5b+": 1302,
    "5c6b+": 1303,
    "5i8f": 1304,
    "6a8c+": 1305,
    "6d6b+": 1306,
    "6e8e": 1307,
    "8f8i": 1308,
    "8i2i": 1309,
    "9b9c": 1310,
    "B*6i": 1311,
    "L*1d": 1312,
    "N*8g": 1313,
    "1a1c": 1314,
    "1e1b+": 1315,
    "1h3h": 1316,
    "2f4h": 1317,
    "3e1g": 1318,
    "3i3f": 1319,
    "4f2h": 1320,
    "5e2b+": 1321,
    "6a9a+": 1322,
    "6b7c+": 1323,
    "6i3i": 1324,
    "7a9a+": 1325,
    "7b8c": 1326,
    "7f7i": 1327,
    "8d8b+": 1328,
    "P*9i": 1329,
    "R*5i": 1330,
    "S*8a": 1331,
    "1a3a": 1332,
    "1a4a": 1333,
    "1e3c+": 1334,
    "2f6b+": 1335,
    "3e3b+": 1336,
    "3e6e": 1337,
    "3g1e": 1338,
    "3h7h": 1339,
    "4d2b+": 1340,
    "5b6a+": 1341,
    "5c7e": 1342,
    "7i9g": 1343,
    "8f6f": 1344,
    "9a5a": 1345,
    "L*1f": 1346,
    "L*9e": 1347,
    "S*9e": 1348,
    "1a6f": 1349,
    "1f3d": 1350,
    "2a1b": 1351,
    "2a3a+": 1352,
    "2d5g": 1353,
    "2f2a+": 1354,
    "3c2a+": 1355,
    "3e5e": 1356,
    "4b3c": 1357,
    "4e3c": 1358,
    "4f4h": 1359,
    "4g4i": 1360,
    "5b6c": 1361,
    "5d3d": 1362,
    "5f2c+": 1363,
    "5f5h": 1364,
    "5g5e": 1365,
    "6d6a+": 1366,
    "7h4h": 1367,
    "8a5a": 1368,
    "8a8b+": 1369,
    "8c9a+": 1370,
    "9f9g": 1371,
    "G*2g": 1372,
    "R*8e": 1373,
    "S*9h": 1374,
    "1h1i": 1375,
    "1h2i": 1376,
    "3h1h": 1377,
    "4a3a+": 1378,
    "4a5a+": 1379,
    "4d7g": 1380,
    "5c4a+": 1381,
    "6a3d+": 1382,
    "6a5a+": 1383,
    "6e5c": 1384,
    "7a7b+": 1385,
    "7c8d": 1386,
    "7e7c+": 1387,
    "7f4f": 1388,
    "8a6a": 1389,
    "8c6e+": 1390,
    "8e8a+": 1391,
    "9a4a": 1392,
    "9a9c": 1393,
    "9h9e": 1394,
    "B*9b": 1395,
    "L*9g": 1396,
    "R*4e": 1397,
    "S*9b": 1398,
    "1f2d": 1399,
    "1g3e": 1400,
    "2a4c": 1401,
    "2d1e": 1402,
    "2f5i": 1403,
    "3e7e": 1404,
    "3i6f": 1405,
    "4a1a+": 1406,
    "4a4b+": 1407,
    "4d2f": 1408,
    "4f1c+": 1409,
    "4i6i": 1410,
    "5g5i": 1411,
    "6d4b+": 1412,
    "6g6i": 1413,
    "6g7e": 1414,
    "6h1c+": 1415,
    "6i6d": 1416,
    "7a3e+": 1417,
    "7b6a+": 1418,
    "7d5b+": 1419,
    "9d9c": 1420,
    "B*1c": 1421,
    "P*1i": 1422,
    "R*3d": 1423,
    "1d1e": 1424,
    "2i9i": 1425,
    "3a1a+": 1426,
    "3f5d": 1427,
    "4a6a+": 1428,
    "4f7i": 1429,
    "4g4e": 1430,
    "5d5b+": 1431,
    "5f7h": 1432,
    "5f8c+": 1433,
    "5i3i": 1434,
    "6b7c": 1435,
    "6g6e": 1436,
    "6h2h": 1437,
    "7f7c+": 1438,
    "7f7h": 1439,
    "7f9f": 1440,
    "8f8h": 1441,
    "9e7g": 1442,
    "B*7i": 1443,
    "G*1c": 1444,
    "N*1c": 1445,
    "N*9c": 1446,
    "S*8i": 1447,
    "S*9f": 1448,
    "1g4d": 1449,
    "2h2a+": 1450,
    "3g7c+": 1451,
    "4d6b+": 1452,
    "4e4h": 1453,
    "4g6e": 1454,
    "5b4a+": 1455,
    "6e8c+": 1456,
    "7b5d+": 1457,
    "7c8d+": 1458,
    "8b5b+": 1459,
    "8d5g": 1460,
    "9e6h": 1461,
    "L*1e": 1462,
    "2a6a": 1463,
    "2d5d": 1464,
    "2e6e": 1465,
    "4e2e": 1466,
    "4h7e": 1467,
    "4h7h": 1468,
    "4i4d": 1469,
    "5d3f": 1470,
    "5e5h": 1471,
    "5h1h": 1472,
    "6a6b+": 1473,
    "6d6f": 1474,
    "6d8b+": 1475,
    "7c5e": 1476,
    "7i7f": 1477,
    "7i8g": 1478,
    "8a9b": 1479,
    "8b9b": 1480,
    "8c6a": 1481,
    "8c6a+": 1482,
    "8c7a+": 1483,
    "8d5a+": 1484,
    "B*1d": 1485,
    "B*3i": 1486,
    "L*9d": 1487,
    "R*2e": 1488,
    "R*3c": 1489,
    "R*3e": 1490,
    "R*7i": 1491,
    "S*1a": 1492,
    "1e3g": 1493,
    "2b1b": 1494,
    "2e2b+": 1495,
    "2e5e": 1496,
    "3c4d+": 1497,
    "3d1f": 1498,
    "3f3b+": 1499,
    "3i7i": 1500,
    "4a7d+": 1501,
    "4d7a+": 1502,
    "4e2c+": 1503,
    "4e6c+": 1504,
    "4f6f": 1505,
    "5f3h": 1506,
    "5g4e": 1507,
    "6a6d+": 1508,
    "6i4i": 1509,
    "7i7g": 1510,
    "8a4a": 1511,
    "8a7b+": 1512,
    "8c9c": 1513,
    "8h4h": 1514,
    "1a7g": 1515,
    "1d2c": 1516,
    "1h1f": 1517,
    "1h6h": 1518,
    "2a2b+": 1519,
    "2a5d": 1520,
    "2b4b": 1521,
    "2d5a+": 1522,
    "2g2c+": 1523,
    "3d6g": 1524,
    "3f3c+": 1525,
    "4e6e": 1526,
    "4g4d": 1527,
    "4g5e": 1528,
    "4i7i": 1529,
    "5a3c+": 1530,
    "5a8a": 1531,
    "5g5d": 1532,
    "7c6a+": 1533,
    "7c9a+": 1534,
    "7e7h": 1535,
    "7e9g": 1536,
    "7i2i": 1537,
    "8d9b+": 1538,
    "8i6i": 1539,
    "8i8g": 1540,
    "9a4f": 1541,
    "9a6a": 1542,
    "9b9a": 1543,
    "B*9d": 1544,
    "G*1d": 1545,
    "L*1g": 1546,
    "L*2c": 1547,
    "L*9c": 1548,
    "R*5f": 1549,
    "R*7c": 1550,
    "S*1f": 1551,
    "1d2b+": 1552,
    "1d2c+": 1553,
    "1h1d": 1554,
    "2a5a": 1555,
    "2c1c": 1556,
    "2c2e": 1557,
    "2h4f": 1558,
    "3a4a+": 1559,
    "3c2d+": 1560,
    "3d8d": 1561,
    "3e6b+": 1562,
    "3g3e": 1563,
    "3i5g": 1564,
    "4a4c+": 1565,
    "4d4b+": 1566,
    "4h4c+": 1567,
    "6c8a+": 1568,
    "6e2e": 1569,
    "6e6i": 1570,
    "6g3d": 1571,
    "6h3h": 1572,
    "6i8i": 1573,
    "7a7c+": 1574,
    "7c5a": 1575,
    "7d5d": 1576,
    "7e4b+": 1577,
    "7f5d": 1578,
    "7i5i": 1579,
    "8c5f+": 1580,
    "8d8i": 1581,
    "8d9c+": 1582,
    "8f3f": 1583,
    "8i4i": 1584,
    "9g5c+": 1585,
    "G*1e": 1586,
    "G*9h": 1587,
    "R*2d": 1588,
    "R*3h": 1589,
    "S*1d": 1590,
    "S*1e": 1591,
    "S*1g": 1592,
    "S*9a": 1593,
    "S*9d": 1594,
    "S*9g": 1595,
    "1g1h": 1596,
    "2e1f": 1597,
    "2g3e": 1598,
    "3a1a": 1599,
    "3a3b+": 1600,
    "3c1a": 1601,
    "3d6d": 1602,
    "4a6a": 1603,
    "4c6a+": 1604,
    "4f8b+": 1605,
    "5a4a+": 1606,
    "5a8a+": 1607,
    "5d3b+": 1608,
    "5d7f": 1609,
    "5e8b+": 1610,
    "5g7i": 1611,
    "6c4e": 1612,
    "6f3f": 1613,
    "6f6a+": 1614,
    "6f8f": 1615,
    "7i4i": 1616,
    "8a5d": 1617,
    "8c5f": 1618,
    "8d6b+": 1619,
    "8d6d": 1620,
    "9e6b+": 1621,
    "9e9f": 1622,
    "9f9d": 1623,
    "N*9f": 1624,
    "N*9h": 1625,
    "R*2f": 1626,
    "R*2h": 1627,
    "R*5d": 1628,
    "R*5e": 1629,
    "1e2e": 1630,
    "1f4f": 1631,
    "2g5d": 1632,
    "3c4b+": 1633,
    "3c6f": 1634,
    "3d5b+": 1635,
    "4a2a": 1636,
    "4b3a+": 1637,
    "4c5a+": 1638,
    "5f5b+": 1639,
    "5i9e": 1640,
    "6a6c+": 1641,
    "6a9a": 1642,
    "6c8a": 1643,
    "6f2f": 1644,
    "7a2f+": 1645,
    "7a4a": 1646,
    "7c7a": 1647,
    "7c8b+": 1648,
    "8b9c": 1649,
    "8c8a+": 1650,
    "8e2e": 1651,
    "8e7c": 1652,
    "8f9d": 1653,
    "8i8d": 1654,
    "9a3a": 1655,
    "9a7a": 1656,
    "9d8c": 1657,
    "9f9c+": 1658,
    "G*1b": 1659,
    "G*9b": 1660,
    "L*7c": 1661,
    "R*4d": 1662,
    "R*4h": 1663,
    "R*6d": 1664,
    "S*1h": 1665,
    "1a1d": 1666,
    "1a6a": 1667,
    "1f3f": 1668,
    "2b1c": 1669,
    "2f7a+": 1670,
    "2h2b+": 1671,
    "2h6d": 1672,
    "3a6d+": 1673,
    "3c5a": 1674,
    "3e2c": 1675,
    "4a1a": 1676,
    "4e6g": 1677,
    "4e8e": 1678,
    "5a2d+": 1679,
    "5h5c+": 1680,
    "6e7c": 1681,
    "6g4e": 1682,
    "7a5c": 1683,
    "7d7b+": 1684,
    "8a6a+": 1685,
    "8a7a+": 1686,
    "8d9c": 1687,
    "8e8b+": 1688,
    "8f8a+": 1689,
    "8f8b+": 1690,
    "9d9e": 1691,
    "9e8e": 1692,
    "9e9b+": 1693,
    "9f7d": 1694,
    "9g9e": 1695,
    "N*9g": 1696,
    "R*5h": 1697,
    "R*7d": 1698,
    "1f3h": 1699,
    "1f5f": 1700,
    "1g1d": 1701,
    "1h7h": 1702,
    "1i4i": 1703,
    "2b5b": 1704,
    "2d1b+": 1705,
    "2f2b+": 1706,
    "3d3g": 1707,
    "3e3a+": 1708,
    "3f5h": 1709,
    "3i3d": 1710,
    "4c6a": 1711,
    "4c6e": 1712,
    "4d4a+": 1713,
    "4g8c+": 1714,
    "5e2h": 1715,
    "5e3e": 1716,
    "5e7e": 1717,
    "5e8e": 1718,
    "5f1f": 1719,
    "5i5c+": 1720,
    "6d9g": 1721,
    "6e3b+": 1722,
    "6e6b+": 1723,
    "7a5a+": 1724,
    "7a7d+": 1725,
    "7d7a+": 1726,
    "7e4h": 1727,
    "8b6d": 1728,
    "8b6d+": 1729,
    "8b7a+": 1730,
    "8b8d+": 1731,
    "8d8h": 1732,
    "8e6e": 1733,
    "9d8b+": 1734,
    "9e5a+": 1735,
    "9f6c+": 1736,
    "B*9a": 1737,
    "G*9c": 1738,
    "L*1c": 1739,
    "R*4i": 1740,
    "R*7e": 1741,
    "1a2b+": 1742,
    "1b2a+": 1743,
    "1c2d": 1744,
    "1d2d": 1745,
    "1f1c+": 1746,
    "1f1d": 1747,
    "1f4c+": 1748,
    "2a2c": 1749,
    "2a7a": 1750,
    "2c1a+": 1751,
    "2g5g": 1752,
    "3b4a+": 1753,
    "3d3h": 1754,
    "3f1h": 1755,
    "3g3i": 1756,
    "3i8i": 1757,
    "4b5a+": 1758,
    "4f7f": 1759,
    "4h8d": 1760,
    "4i8i": 1761,
    "5c2f": 1762,
    "5e5b+": 1763,
    "5e5g": 1764,
    "6a8a": 1765,
    "6e2a+": 1766,
    "6e4c+": 1767,
    "6e4g": 1768,
    "6h6a+": 1769,
    "7d4g": 1770,
    "7e7b+": 1771,
    "8a2a": 1772,
    "8a8e+": 1773,
    "8b4b+": 1774,
    "8b6b+": 1775,
    "8c9d+": 1776,
    "8e5e": 1777,
    "8h3h": 1778,
    "9b8c": 1779,
    "9c8d": 1780,
    "B*4i": 1781,
    "G*1f": 1782,
    "G*8a": 1783,
    "G*9g": 1784,
    "N*1g": 1785,
    "R*3i": 1786,
    "R*6i": 1787,
    "R*7f": 1788,
    "1b2c+": 1789,
    "1d1c": 1790,
    "1d2e": 1791,
    "1f1g": 1792,
    "1g5c+": 1793,
    "2a1b+": 1794,
    "2b3a+": 1795,
    "2b3b+": 1796,
    "2b4d": 1797,
    "2d1c+": 1798,
    "3b5b": 1799,
    "3c3a": 1800,
    "3c5e": 1801,
    "3c7g": 1802,
    "3d3a+": 1803,
    "3d5b": 1804,
    "3h4f": 1805,
    "4a4d+": 1806,
    "4a7a+": 1807,
    "4a8a+": 1808,
    "4f1f": 1809,
    "4g7d": 1810,
    "4h1e": 1811,
    "4h3f": 1812,
    "5c7e+": 1813,
    "5c8f": 1814,
    "5e2e": 1815,
    "5h3f": 1816,
    "5h4f": 1817,
    "5i1e": 1818,
    "6a4a": 1819,
    "6b4d": 1820,
    "6b4d+": 1821,
    "6c6a+": 1822,
    "6c8e": 1823,
    "6f4f": 1824,
    "6h7f": 1825,
    "7c5e+": 1826,
    "7f4c+": 1827,
    "7g7e": 1828,
    "7h3h": 1829,
    "7i6g": 1830,
    "8a2a+": 1831,
    "8a8d": 1832,
    "8b7b+": 1833,
    "8d9d": 1834,
    "8f2f": 1835,
    "8g8i": 1836,
    "8h8e": 1837,
    "9d9b+": 1838,
    "9e8c+": 1839,
    "B*5i": 1840,
    "R*3f": 1841,
    "R*4f": 1842,
    "R*6e": 1843,
    "R*6h": 1844,
    "R*7h": 1845,
    "S*2i": 1846,
    "1a5a": 1847,
    "1h5d": 1848,
    "2a2c+": 1849,
    "2a6a+": 1850,
    "2c5f": 1851,
    "3a3c+": 1852,
    "3c2b+": 1853,
    "3c2d": 1854,
    "3g3c+": 1855,
    "3h2f": 1856,
    "3h3c+": 1857,
    "3h5f": 1858,
    "4c6e+": 1859,
    "4e4g": 1860,
    "4h8h": 1861,
    "5a2a": 1862,
    "5a2a+": 1863,
    "5a5c": 1864,
    "5c3e+": 1865,
    "5d7b+": 1866,
    "6a4c": 1867,
    "6a6c": 1868,
    "6c5a+": 1869,
    "6c7a+": 1870,
    "6f6h": 1871,
    "6g5e": 1872,
    "6h6c+": 1873,
    "6i5g": 1874,
    "7a6a+": 1875,
    "7a9a": 1876,
    "7b4b": 1877,
    "7b4e+": 1878,
    "7b5b": 1879,
    "7c6b+": 1880,
    "7c8a+": 1881,
    "7e9c+": 1882,
    "7i7d": 1883,
    "8a3a": 1884,
    "8a8e": 1885,
    "8b4f": 1886,
    "8c9d": 1887,
    "8d8g": 1888,
    "8e8i": 1889,
    "8e9e": 1890,
    "9c6f": 1891,
    "9d8d": 1892,
    "9d8e": 1893,
    "9e5i": 1894,
    "G*1h": 1895,
    "R*8f": 1896,
    "R*8h": 1897,
    "1e4b+": 1898,
    "1h3f": 1899,
    "1h4e": 1900,
    "2a2d": 1901,
    "2a4a+": 1902,
    "2h5e": 1903,
    "3a5a+": 1904,
    "3b2b+": 1905,
    "3c1a+": 1906,
    "3e3g": 1907,
    "3e7i": 1908,
    "3f1d": 1909,
    "3g3d": 1910,
    "3i1g": 1911,
    "3i3c+": 1912,
    "4a4c": 1913,
    "4d2d": 1914,
    "4d6d": 1915,
    "4g2g": 1916,
    "4i3g": 1917,
    "5a3a": 1918,
    "5a6a+": 1919,
    "5a9a+": 1920,
    "5b3d+": 1921,
    "5c3a+": 1922,
    "5d7d": 1923,
    "6d3d": 1924,
    "7a4a+": 1925,
    "7a5a": 1926,
    "7e5e": 1927,
    "7e7g": 1928,
    "7h7c+": 1929,
    "8a1a": 1930,
    "8a8c": 1931,
    "8b5b": 1932,
    "8e8h": 1933,
    "8f4f": 1934,
    "8g7e": 1935,
    "8i3i": 1936,
    "8i8e": 1937,
    "9h9i": 1938,
    "9i2i": 1939,
    "G*9d": 1940,
    "L*6b": 1941,
    "1d1a+": 1942,
    "1d3d": 1943,
    "1e4h": 1944,
    "2a5d+": 1945,
    "2b5b+": 1946,
    "2b5e+": 1947,
    "2c2h": 1948,
    "2c2i": 1949,
    "2c3a+": 1950,
    "2e1c": 1951,
    "2i2b+": 1952,
    "3a3d+": 1953,
    "3a6a": 1954,
    "3a7e+": 1955,
    "3b5d": 1956,
    "3c4a+": 1957,
    "4a7a": 1958,
    "4c4a+": 1959,
    "4d1a": 1960,
    "4d4i": 1961,
    "4e7e": 1962,
    "4g4c+": 1963,
    "4i5g": 1964,
    "5a5b+": 1965,
    "5b3b": 1966,
    "5b3b+": 1967,
    "5c7a+": 1968,
    "5e4c": 1969,
    "5g1c+": 1970,
    "5h6f": 1971,
    "6a4a+": 1972,
    "6a8c": 1973,
    "6b5a+": 1974,
    "6c4e+": 1975,
    "6c6a": 1976,
    "6d3a+": 1977,
    "6d4b": 1978,
    "6d4d": 1979,
    "6d6i": 1980,
    "6e3h": 1981,
    "6e6a+": 1982,
    "6e8g": 1983,
    "6h6b+": 1984,
    "6i7g": 1985,
    "7b6b+": 1986,
    "7b7c+": 1987,
    "7d4a+": 1988,
    "7d7i": 1989,
    "7e4e": 1990,
    "7g5g": 1991,
    "7h2h": 1992,
    "7h4e": 1993,
    "7h5f": 1994,
    "7i7e": 1995,
    "8b5e": 1996,
    "8b8g+": 1997,
    "8c9b+": 1998,
    "8e3e": 1999,
    "8e4e": 2000,
    "8e6c+": 2001,
    "8g8e": 2002,
    "9d8c+": 2003,
    "9f5f": 2004,
    "1c2a+": 2005,
    "1c4f": 2006,
    "1f1h": 2007,
    "1g1c+": 2008,
    "1i4f": 2009,
    "2a2d+": 2010,
    "2b2c+": 2011,
    "2c1d+": 2012,
    "2d8d": 2013,
    "2e4g": 2014,
    "3b5b+": 2015,
    "3c5e+": 2016,
    "3d3i": 2017,
    "3e1e": 2018,
    "3f6i": 2019,
    "3f7b+": 2020,
    "3g5g": 2021,
    "3h6e": 2022,
    "4a4d": 2023,
    "4a6c": 2024,
    "4a9a+": 2025,
    "4b2b": 2026,
    "4b3b+": 2027,
    "4e4a+": 2028,
    "4e4b+": 2029,
    "4e6c": 2030,
    "4g2e": 2031,
    "4h4b+": 2032,
    "4h5f": 2033,
    "5a1a": 2034,
    "5a7a": 2035,
    "5a8d+": 2036,
    "5b6b+": 2037,
    "5b7b+": 2038,
    "5c3a": 2039,
    "5c3e": 2040,
    "5d8a": 2041,
    "5e6c": 2042,
    "5g5c+": 2043,
    "5h7f": 2044,
    "6a2a+": 2045,
    "6a3d": 2046,
    "6a6e": 2047,
    "6b4b": 2048,
    "6b6d": 2049,
    "6c3f+": 2050,
    "6c4a+": 2051,
    "6e6g": 2052,
    "6g4i": 2053,
    "6g8e": 2054,
    "7a2a+": 2055,
    "7b5d": 2056,
    "7c9a": 2057,
    "7c9e+": 2058,
    "7d5b": 2059,
    "7e3a+": 2060,
    "7f7b+": 2061,
    "7i3i": 2062,
    "8a6c+": 2063,
    "8b8c+": 2064,
    "8b8f+": 2065,
    "8e9c": 2066,
    "9a9b+": 2067,
    "9b8a+": 2068,
    "9b9c+": 2069,
    "9c9a": 2070,
    "9f7h": 2071,
    "9h9c+": 2072,
    "G*1g": 2073,
    "G*9e": 2074,
    "L*5b": 2075,
    "R*1c": 2076,
    "R*8i": 2077,
    "1a7a": 2078,
    "1c2d+": 2079,
    "1f1b+": 2080,
    "1g3i": 2081,
    "1h1c+": 2082,
    "1i1a+": 2083,
    "1i6i": 2084,
    "2a8a": 2085,
    "2b4d+": 2086,
    "2b5e": 2087,
    "2c1d": 2088,
    "2c4a+": 2089,
    "2c4c": 2090,
    "2c5c": 2091,
    "2d1c": 2092,
    "2e5b+": 2093,
    "3a6a+": 2094,
    "3a8f+": 2095,
    "3b6b": 2096,
    "3d1d": 2097,
    "3d6a+": 2098,
    "3d7h": 2099,
    "3g8b+": 2100,
    "3g9a+": 2101,
    "4a4e+": 2102,
    "4a8a": 2103,
    "4c4a": 2104,
    "4c4e": 2105,
    "4i1i": 2106,
    "4i4c+": 2107,
    "5a3a+": 2108,
    "5a5c+": 2109,
    "5a7a+": 2110,
    "5d5a+": 2111,
    "5g2g": 2112,
    "5h9h": 2113,
    "5i1i": 2114,
    "5i4g": 2115,
    "5i6g": 2116,
    "6a2a": 2117,
    "6a3a": 2118,
    "6a7a+": 2119,
    "6b7a+": 2120,
    "6b8d": 2121,
    "6e3e": 2122,
    "6f9f": 2123,
    "6g6d": 2124,
    "7c4f": 2125,
    "7c9e": 2126,
    "7d4a": 2127,
    "7g7d": 2128,
    "8a8d+": 2129,
    "8a8f+": 2130,
    "8c8a": 2131,
    "8e4a": 2132,
    "8f3a+": 2133,
    "8i8a+": 2134,
    "9b6e": 2135,
    "9b7d": 2136,
    "9c8d+": 2137,
    "9d9a+": 2138,
    "R*1h": 2139,
    "R*2g": 2140,
    "R*6f": 2141,
    "R*6g": 2142,
    "1a1b+": 2143,
    "1b3b": 2144,
    "1d1f": 2145,
    "1d4g": 2146,
    "1e4e": 2147,
    "1f5b+": 2148,
    "1g4g": 2149,
    "2a2e": 2150,
    "2b6b": 2151,
    "2c1b+": 2152,
    "2c2a+": 2153,
    "2c4e": 2154,
    "2c4e+": 2155,
    "2g2a+": 2156,
    "2g4i": 2157,
    "2i2a+": 2158,
    "3a5c": 2159,
    "3a7a": 2160,
    "3a7a+": 2161,
    "3b3c+": 2162,
    "3b3d": 2163,
    "3c3a+": 2164,
    "3d3b": 2165,
    "3e4c": 2166,
    "3f6c+": 2167,
    "3i4g": 2168,
    "4a4e": 2169,
    "4a9a": 2170,
    "4b2d": 2171,
    "4b4c+": 2172,
    "4b5b+": 2173,
    "4b6d+": 2174,
    "4c3a+": 2175,
    "4d7d": 2176,
    "4d8h": 2177,
    "4e1h": 2178,
    "4e2g": 2179,
    "4e7h": 2180,
    "4i9i": 2181,
    "5a5d": 2182,
    "5b4b+": 2183,
    "5c2f+": 2184,
    "5c5e": 2185,
    "5c7a": 2186,
    "5d7b": 2187,
    "5f8c": 2188,
    "5f9f": 2189,
    "5g9c+": 2190,
    "5h5b+": 2191,
    "6b6d+": 2192,
    "6c6d+": 2193,
    "6d2d": 2194,
    "6d8d": 2195,
    "6g2c+": 2196,
    "6h1h": 2197,
    "6h5f": 2198,
    "7a4d": 2199,
    "7d3d": 2200,
    "7d3h": 2201,
    "7d7a": 2202,
    "7d9b+": 2203,
    "7e3e": 2204,
    "8a5d+": 2205,
    "8b6b": 2206,
    "8b8e+": 2207,
    "8b9c+": 2208,
    "8c6c": 2209,
    "8c6e": 2210,
    "8d3d": 2211,
    "8d6b": 2212,
    "8e8b": 2213,
    "9a3g": 2214,
    "9c8a+": 2215,
    "B*1i": 2216,
    "R*2i": 2217,
    "R*7g": 2218,
    "R*8g": 2219,
    "1b2b+": 2220,
    "1b3b+": 2221,
    "1b3d": 2222,
    "1e5a+": 2223,
    "1e5e": 2224,
    "1f1a+": 2225,
    "1g3g": 2226,
    "1h7b+": 2227,
    "2a2h": 2228,
    "2a4c+": 2229,
    "2a8a+": 2230,
    "2a9a": 2231,
    "2b1c+": 2232,
    "2c2f": 2233,
    "2c4a": 2234,
    "2e4c+": 2235,
    "2f5c": 2236,
    "2g2b+": 2237,
    "2g4e": 2238,
    "2g6c+": 2239,
    "3a3c": 2240,
    "3a5a": 2241,
    "3a7e": 2242,
    "3c5a+": 2243,
    "3d1b+": 2244,
    "3e5c": 2245,
    "3g1g": 2246,
    "3h3b+": 2247,
    "3i1i": 2248,
    "3i2g": 2249,
    "4b2b+": 2250,
    "4b7b": 2251,
    "4b7e+": 2252,
    "4c2a+": 2253,
    "4d4f": 2254,
    "4e8a+": 2255,
    "4f8f": 2256,
    "4h9h": 2257,
    "5a2d": 2258,
    "5a7c": 2259,
    "5a9a": 2260,
    "5b3d": 2261,
    "5b5c+": 2262,
    "5b7b": 2263,
    "5b7d": 2264,
    "5c5a+": 2265,
    "5c6c+": 2266,
    "5c8f+": 2267,
    "5d2a+": 2268,
    "5d5h": 2269,
    "5d8a+": 2270,
    "5e5a+": 2271,
    "5e9a": 2272,
    "5f1b+": 2273,
    "5f5a+": 2274,
    "6a1a": 2275,
    "6a3a+": 2276,
    "6a6d": 2277,
    "6c6e": 2278,
    "6e4c": 2279,
    "6f6b+": 2280,
    "6g4g": 2281,
    "6i6a+": 2282,
    "7a7e": 2283,
    "7a7e+": 2284,
    "7c5c": 2285,
    "7d7g": 2286,
    "7e5c": 2287,
    "7e8c": 2288,
    "7e9e": 2289,
    "7h9h": 2290,
    "7i1c+": 2291,
    "8a4e": 2292,
    "8b3b": 2293,
    "8b8e": 2294,
    "8b9b+": 2295,
    "8c8e+": 2296,
    "8d8b": 2297,
    "8e8g": 2298,
    "8g6g": 2299,
    "9a8b+": 2300,
    "9a9f": 2301,
    "9b7d+": 2302,
    "9c6f+": 2303,
    "9e9a+": 2304,
    "9f9b+": 2305,
    "9g9d": 2306,
    "G*9f": 2307,
    "R*5g": 2308,
    "R*9d": 2309,
    "1a2a+": 2310,
    "1a3c+": 2311,
    "1c2b+": 2312,
    "1c3e": 2313,
    "1e1c": 2314,
    "1f6f": 2315,
    "1h1b+": 2316,
    "1h6c+": 2317,
    "2a2f": 2318,
    "2a2g": 2319,
    "2a5a+": 2320,
    "2a6e": 2321,
    "2a6e+": 2322,
    "2b1b+": 2323,
    "2b4b+": 2324,
    "2b6f+": 2325,
    "2c2g": 2326,
    "2c5f+": 2327,
    "2e2b": 2328,
    "2e6a+": 2329,
    "2h1f": 2330,
    "3a1c+": 2331,
    "3b1b+": 2332,
    "3b3d+": 2333,
    "3b5d+": 2334,
    "3d6a": 2335,
    "3g1i": 2336,
    "3g6g": 2337,
    "4a2c": 2338,
    "4a8e+": 2339,
    "4b4d+": 2340,
    "4b4f": 2341,
    "4b6b": 2342,
    "4d1g": 2343,
    "4d4h": 2344,
    "4e4c": 2345,
    "4e7b+": 2346,
    "4f4a+": 2347,
    "5a1a+": 2348,
    "5a1e+": 2349,
    "5a3c": 2350,
    "5a5d+": 2351,
    "5b5d": 2352,
    "5b5e": 2353,
    "5c5f": 2354,
    "5d2g": 2355,
    "5d8g": 2356,
    "5e1a": 2357,
    "5e3c": 2358,
    "5f2c": 2359,
    "5g3g": 2360,
    "5g7g": 2361,
    "5h1d": 2362,
    "5i9i": 2363,
    "6a6g": 2364,
    "6b3b+": 2365,
    "6b6c+": 2366,
    "6b8b+": 2367,
    "6b8d+": 2368,
    "6c4c": 2369,
    "6c8e+": 2370,
    "6d2h": 2371,
    "6d3a": 2372,
    "6d6b": 2373,
    "6e4e": 2374,
    "6e6h": 2375,
    "6e8c": 2376,
    "6g6c+": 2377,
    "6h9h": 2378,
    "6i1i": 2379,
    "6i4g": 2380,
    "7a7c": 2381,
    "7a7d": 2382,
    "7a9c+": 2383,
    "7b4e": 2384,
    "7b9d+": 2385,
    "7c3g": 2386,
    "7e1e": 2387,
    "7e3i": 2388,
    "7e6c": 2389,
    "7e7b": 2390,
    "7f7a+": 2391,
    "7g9i": 2392,
    "7i7c+": 2393,
    "8a5a+": 2394,
    "8b4b": 2395,
    "8b8d": 2396,
    "8c3h+": 2397,
    "8d2d": 2398,
    "8d4h": 2399,
    "8f8b": 2400,
    "8g8d": 2401,
    "8h2h": 2402,
    "8h8b+": 2403,
    "8h9f": 2404,
    "9a8a+": 2405,
    "9b5f": 2406,
    "9b8b+": 2407,
    "9c4h": 2408,
    "9c9a+": 2409,
    "9f7f": 2410,
    "9f9a+": 2411,
    "9g3a+": 2412,
    "9h4h": 2413,
    "G*1a": 2414,
    "L*3b": 2415,
    "L*8b": 2416,
    "R*1f": 2417,
    "R*9c": 2418,
    "1a1d+": 2419,
    "1a4d+": 2420,
    "1b4b": 2421,
    "1d3f": 2422,
    "1e1h": 2423,
    "1e1i": 2424,
    "1f4i": 2425,
    "1f6a+": 2426,
    "1g6b+": 2427,
    "1i5i": 2428,
    "1i6d": 2429,
    "2b2d": 2430,
    "2b2f": 2431,
    "2b6f": 2432,
    "2c6g": 2433,
    "2d2b": 2434,
    "2d5a": 2435,
    "2d7i": 2436,
    "2g1e": 2437,
    "2h7c+": 2438,
    "3a9a": 2439,
    "3b1b": 2440,
    "3b4b+": 2441,
    "3c1e": 2442,
    "3e1c+": 2443,
    "3e7a+": 2444,
    "3f3a+": 2445,
    "3f6c": 2446,
    "3g3b+": 2447,
    "3h1f": 2448,
    "3h7d": 2449,
    "3h8c+": 2450,
    "3h8h": 2451,
    "3i9i": 2452,
    "4a4f+": 2453,
    "4a7d": 2454,
    "4b6b+": 2455,
    "4b7e": 2456,
    "4d2b": 2457,
    "4d4a": 2458,
    "4d4b": 2459,
    "4d6b": 2460,
    "4d7a": 2461,
    "4f4b+": 2462,
    "4g2i": 2463,
    "4g6g": 2464,
    "4i1f": 2465,
    "5d3b": 2466,
    "5f5c": 2467,
    "5h8e": 2468,
    "6a6e+": 2469,
    "6a6f+": 2470,
    "6b2f+": 2471,
    "6b3e": 2472,
    "6c9f": 2473,
    "6d9a": 2474,
    "6e6c": 2475,
    "6f1a": 2476,
    "6f3c": 2477,
    "7a3a": 2478,
    "7b4b+": 2479,
    "7b5b+": 2480,
    "7b7e": 2481,
    "7b7e+": 2482,
    "7b7f": 2483,
    "7b7f+": 2484,
    "7b8b+": 2485,
    "7c4c": 2486,
    "7c7a+": 2487,
    "7c7f": 2488,
    "7e4b": 2489,
    "7e7a+": 2490,
    "7e7i": 2491,
    "7f9d": 2492,
    "7g7c+": 2493,
    "7g7i": 2494,
    "7h3d": 2495,
    "7h8f": 2496,
    "7i1i": 2497,
    "8a3a+": 2498,
    "8a8g": 2499,
    "8b8f": 2500,
    "8c3h": 2501,
    "8c8d+": 2502,
    "8d3i": 2503,
    "8d5a": 2504,
    "8e6c": 2505,
    "8e8a": 2506,
    "8e8c": 2507,
    "8i1i": 2508,
    "9a9d": 2509,
    "9b9d": 2510,
    "9c7e": 2511,
    "9f8d": 2512,
    "9g4b+": 2513,
    "9g9c+": 2514,
    "9h5d": 2515,
    "9h9d": 2516,
    "9i9a+": 2517,
    "L*2b": 2518,
    "L*7b": 2519,
    "N*1h": 2520,
    "R*1e": 2521,
    "R*4g": 2522,
    "R*9g": 2523,
    "1a8a": 2524,
    "1c1a": 2525,
    "1c3a": 2526,
    "1c4f+": 2527,
    "1c6h": 2528,
    "1d3b+": 2529,
    "1e3e": 2530,
    "1e7e": 2531,
    "1h1a+": 2532,
    "1i1b+": 2533,
    "2b2e": 2534,
    "2c6c": 2535,
    "2e5h": 2536,
    "2e9e": 2537,
    "2f9f": 2538,
    "2g6g": 2539,
    "2g7b+": 2540,
    "2g7g": 2541,
    "3a3e+": 2542,
    "3a6d": 2543,
    "3a8a+": 2544,
    "3b7b": 2545,
    "3b7b+": 2546,
    "3c7g+": 2547,
    "3f8a+": 2548,
    "3i8d": 2549,
    "4b4d": 2550,
    "4c2a": 2551,
    "4c2e+": 2552,
    "4c6c": 2553,
    "4f1i": 2554,
    "4g7g": 2555,
    "4i4b+": 2556,
    "5a5e+": 2557,
    "5a5h+": 2558,
    "5a8d": 2559,
    "5b5e+": 2560,
    "5b7d+": 2561,
    "5b8b": 2562,
    "5c1g+": 2563,
    "5c5a": 2564,
    "5c5d+": 2565,
    "5c5f+": 2566,
    "5c7c": 2567,
    "5d5g": 2568,
    "5d8d": 2569,
    "5e2b": 2570,
    "5f9b+": 2571,
    "5h5a+": 2572,
    "5i5a+": 2573,
    "6a1a+": 2574,
    "6b5b+": 2575,
    "6b6h": 2576,
    "6b7b+": 2577,
    "6b8b": 2578,
    "6c2g+": 2579,
    "6c3c": 2580,
    "6c3f": 2581,
    "6c6f": 2582,
    "6c8c": 2583,
    "6d6a": 2584,
    "6d6h": 2585,
    "6d8b": 2586,
    "6e9b+": 2587,
    "6f1f": 2588,
    "6i3f": 2589,
    "7a1g+": 2590,
    "7a3a+": 2591,
    "7a7f+": 2592,
    "7b3b": 2593,
    "7b3b+": 2594,
    "7b7d+": 2595,
    "7b9b+": 2596,
    "7c4f+": 2597,
    "7c7e": 2598,
    "7d2d": 2599,
    "7d4d": 2600,
    "7d7h": 2601,
    "7d9b": 2602,
    "7d9f": 2603,
    "7f3b+": 2604,
    "7g3c": 2605,
    "7h2c+": 2606,
    "7h6f": 2607,
    "8a8c+": 2608,
    "8a8f": 2609,
    "8a8g+": 2610,
    "8a9b+": 2611,
    "8b5e+": 2612,
    "8c4g": 2613,
    "8c4g+": 2614,
    "8c6c+": 2615,
    "8c7c+": 2616,
    "8c8e": 2617,
    "8d5d": 2618,
    "8d8a": 2619,
    "8e5h": 2620,
    "8e6g": 2621,
    "8f8a": 2622,
    "8g4c+": 2623,
    "8g6e": 2624,
    "8h7f": 2625,
    "9a1a": 2626,
    "9a2a": 2627,
    "9a6a+": 2628,
    "9b5b": 2629,
    "9b6b": 2630,
    "9b8c+": 2631,
    "9b9e+": 2632,
    "9c7c": 2633,
    "9c7e+": 2634,
    "9d6a+": 2635,
    "9d7b+": 2636,
    "9d7d": 2637,
    "9d7f": 2638,
    "9e5a": 2639,
    "9f6f": 2640,
    "9h5h": 2641,
    "9h6e": 2642,
    "L*4b": 2643,
    "S*9i": 2644,
    "1a1c+": 2645,
    "1a1e": 2646,
    "1a4a+": 2647,
    "1a8h": 2648,
    "1a9a": 2649,
    "1b1d": 2650,
    "1b1e": 2651,
    "1b3d+": 2652,
    "1b4b+": 2653,
    "1b4e": 2654,
    "1d1a": 2655,
    "1e2c": 2656,
    "1i7i": 2657,
    "2a2f+": 2658,
    "2a2g+": 2659,
    "2a7a+": 2660,
    "2b2d+": 2661,
    "2b2f+": 2662,
    "2b2i": 2663,
    "2b7b+": 2664,
    "2b7g": 2665,
    "2c2d+": 2666,
    "2c3c+": 2667,
    "2c5c+": 2668,
    "2d2a": 2669,
    "2d4b": 2670,
    "2f2a": 2671,
    "2g2b": 2672,
    "2h3f": 2673,
    "2h9h": 2674,
    "3a3d": 2675,
    "3a3e": 2676,
    "3a8a": 2677,
    "3c3e": 2678,
    "3c8h": 2679,
    "3e9e": 2680,
    "3f9f": 2681,
    "3g9a": 2682,
    "4b1e": 2683,
    "4b4e": 2684,
    "4b4e+": 2685,
    "4b6d": 2686,
    "4c2e": 2687,
    "4c4f": 2688,
    "4c6c+": 2689,
    "4g4a": 2690,
    "4g6i": 2691,
    "4h9c+": 2692,
    "4i6g": 2693,
    "5a9e+": 2694,
    "5b2b": 2695,
    "5b5d+": 2696,
    "5b5f+": 2697,
    "5c5g": 2698,
    "5c5g+": 2699,
    "5d1h": 2700,
    "5d2d": 2701,
    "5e1i": 2702,
    "5e5a": 2703,
    "5e7c": 2704,
    "5e9e": 2705,
    "5f5a": 2706,
    "5g5b+": 2707,
    "5h2e": 2708,
    "6b3b": 2709,
    "6b3e+": 2710,
    "6b4b+": 2711,
    "6b6e": 2712,
    "6b6g": 2713,
    "6c6e+": 2714,
    "6c7c+": 2715,
    "6e3b": 2716,
    "6e9e": 2717,
    "6g6a": 2718,
    "6i6b+": 2719,
    "6i8g": 2720,
    "7a1a+": 2721,
    "7a3e": 2722,
    "7b3f+": 2723,
    "7b7d": 2724,
    "7b9b": 2725,
    "7b9d": 2726,
    "7c3g+": 2727,
    "7d2i": 2728,
    "7d9d": 2729,
    "7e7a": 2730,
    "7e9c": 2731,
    "7f4c": 2732,
    "7f5h": 2733,
    "7f9h": 2734,
    "7g4g": 2735,
    "7g9g": 2736,
    "7h7b+": 2737,
    "7h9f": 2738,
    "8a3f": 2739,
    "8b3b+": 2740,
    "8b3g": 2741,
    "8b8g": 2742,
    "8b8h+": 2743,
    "8c5c": 2744,
    "8e4a+": 2745,
    "8f5c": 2746,
    "8g5d": 2747,
    "8g6i": 2748,
    "8g8a": 2749,
    "8i8b+": 2750,
    "8i8c+": 2751,
    "9a6d+": 2752,
    "9a9c+": 2753,
    "9a9d+": 2754,
    "9a9e": 2755,
    "9b3b": 2756,
    "9b7b": 2757,
    "9b7b+": 2758,
    "9c3i": 2759,
    "9c7a": 2760,
    "9c7a+": 2761,
    "9c8b+": 2762,
    "9c9f": 2763,
    "9d4d": 2764,
    "9d6a": 2765,
    "9d9b": 2766,
    "9e7c": 2767,
    "9e9c": 2768,
    "9f9a": 2769,
    "9g9b+": 2770,
    "9g9c": 2771,
    "9i7g": 2772,
    "B*8i": 2773,
    "G*1i": 2774,
    "L*9b": 2775,
    "N*9i": 2776,
    "R*1d": 2777,
    "R*3g": 2778,
    "1a1f": 2779,
    "1a9a+": 2780,
    "1b5b": 2781,
    "1b6b+": 2782,
    "1c1f": 2783,
    "1c3a+": 2784,
    "1c3c": 2785,
    "1c5g": 2786,
    "1d4a": 2787,
    "1d4d": 2788,
    "1d5h": 2789,
    "1e4b": 2790,
    "1e5i": 2791,
    "1e6e": 2792,
    "1g1b+": 2793,
    "1g1i": 2794,
    "1h1c": 2795,
    "1h2f": 2796,
    "1i3i": 2797,
    "1i8i": 2798,
    "2a2e+": 2799,
