{
  "vocab": {
    "__UNK__": 0,
    "7g7f": 1,
    "3c3d": 2,
    "2g2f": 3,
    "8c8d": 4,
    "3g3f": 5,
    "2c2d": 6,
    "7c7d": 7,
    "4c4d": 8,
    "2f2e": 9,
    "8g8f": 10,
    "6g6f": 11,
    "8d8e": 12,
    "6c6d": 13,
    "4g4f": 14,
    "4a3b": 15,
    "8h7g": 16,
    "5g5f": 17,
    "5c5d": 18,
    "2e2d": 19,
    "2b3c": 20,
    "6i7h": 21,
    "8e8f": 22,
    "9g9f": 23,
    "9c9d": 24,
    "1c1d": 25,
    "1g1f": 26,
    "7a6b": 27,
    "2i3g": 28,
    "3i4h": 29,
    "8a7c": 30,
    "7i6h": 31,
    "3d3e": 32,
    "7i8h": 33,
    "3a2b": 34,
    "3f3e": 35,
    "7f7e": 36,
    "4d4e": 37,
    "5i6h": 38,
    "4i5h": 39,
    "4f4e": 40,
    "6d6e": 41,
    "3a4b": 42,
    "7d7e": 43,
    "5f5e": 44,
    "6a5b": 45,
    "6f6e": 46,
    "2a3c": 47,
    "5d5e": 48,
    "8i7g": 49,
    "P*2c": 50,
    "3i3h": 51,
    "5a4b": 52,
    "P*8g": 53,
    "7a7b": 54,
    "2h2d": 55,
    "6h7g": 56,
    "6b6c": 57,
    "6h7h": 58,
    "8b8f": 59,
    "5a6b": 60,
    "P*3d": 61,
    "6c5d": 62,
    "4h4g": 63,
    "9d9e": 64,
    "4g5f": 65,
    "4b3c": 66,
    "4b4c": 67,
    "3g4e": 68,
    "3c4d": 69,
    "5h6g": 70,
    "3e3d": 71,
    "P*2d": 72,
    "1f1e": 73,
    "P*7f": 74,
    "4e4d": 75,
    "7g6f": 76,
    "6e6f": 77,
    "P*8f": 78,
    "7h8h": 79,
    "8f8e": 80,
    "4b3b": 81,
    "9f9e": 82,
    "3a3b": 83,
    "5a4a": 84,
    "6b5c": 85,
    "7e7d": 86,
    "3e3f": 87,
    "5i4h": 88,
    "5b4c": 89,
    "3b2b": 90,
    "6b7b": 91,
    "4h5g": 92,
    "1d1e": 93,
    "2d2e": 94,
    "7i7h": 95,
    "3b3c": 96,
    "7h7g": 97,
    "5e5d": 98,
    "3b4c": 99,
    "7c6e": 100,
    "5i6i": 101,
    "7e7f": 102,
    "P*8e": 103,
    "5e5f": 104,
    "4e4f": 105,
    "6a6b": 106,
    "P*4d": 107,
    "4i4h": 108,
    "6e6d": 109,
    "6h6g": 110,
    "3h4g": 111,
    "P*2e": 112,
    "P*7d": 113,
    "4h3g": 114,
    "P*3f": 115,
    "6h7i": 116,
    "4a5b": 117,
    "6i7i": 118,
    "5b4b": 119,
    "P*6f": 120,
    "4a3a": 121,
    "8h7i": 122,
    "P*3e": 123,
    "8b8a": 124,
    "4h3h": 125,
    "3c4b": 126,
    "7g8f": 127,
    "7b6c": 128,
    "7g6h": 129,
    "6h5g": 130,
    "6b7c": 131,
    "4b5c": 132,
    "5h6h": 133,
    "6i5h": 134,
    "P*6d": 135,
    "2h2i": 136,
    "P*3c": 137,
    "7h6g": 138,
    "P*7e": 139,
    "P*5d": 140,
    "P*2b": 141,
    "2b7g+": 142,
    "3c2d": 143,
    "P*5e": 144,
    "3g4f": 145,
    "6a7b": 146,
    "7h8g": 147,
    "3d3c+": 148,
    "5a5b": 149,
    "P*4f": 150,
    "P*4e": 151,
    "P*7g": 152,
    "P*6e": 153,
    "3b2c": 154,
    "2b3a": 155,
    "5i5h": 156,
    "7b8b": 157,
    "5b6c": 158,
    "4b3a": 159,
    "P*5f": 160,
    "4i3h": 161,
    "5c6d": 162,
    "7d7c+": 163,
    "5h4g": 164,
    "P*8h": 165,
    "7f7g+": 166,
    "2b2c": 167,
    "4c5d": 168,
    "7c6d": 169,
    "5c4d": 170,
    "4b5b": 171,
    "4c3d": 172,
    "5b6b": 173,
    "3h2h": 174,
    "3f3g+": 175,
    "3b4b": 176,
    "9i9h": 177,
    "8h8g": 178,
    "2d3d": 179,
    "5g4f": 180,
    "2h3h": 181,
    "5g6f": 182,
    "5b5c": 183,
    "3c4e": 184,
    "7g6e": 185,
    "N*5e": 186,
    "6g5f": 187,
    "7a8b": 188,
    "3h3g": 189,
    "8b7b": 190,
    "P*5c": 191,
    "7h6h": 192,
    "7b7c": 193,
    "4f3e": 194,
    "2d2h": 195,
    "6i6h": 196,
    "B*5e": 197,
    "P*4c": 198,
    "3g2e": 199,
    "7c8e": 200,
    "3i2h": 201,
    "8f8g+": 202,
    "2d2c+": 203,
    "5f4e": 204,
    "5h4h": 205,
    "P*5g": 206,
    "5h5g": 207,
    "4d5e": 208,
    "1a1b": 209,
    "N*6e": 210,
    "8f8d": 211,
    "6d7e": 212,
    "P*2f": 213,
    "4d4c+": 214,
    "P*8d": 215,
    "8e8d": 216,
    "4f5e": 217,
    "B*4d": 218,
    "4a4b": 219,
    "8b4b": 220,
    "P*3g": 221,
    "6f5e": 222,
    "P*6g": 223,
    "2h5h": 224,
    "7b8c": 225,
    "N*4e": 226,
    "6d5e": 227,
    "P*6c": 228,
    "3c2b": 229,
    "3h2g": 230,
    "5d6e": 231,
    "P*8c": 232,
    "6f6g+": 233,
    "B*6f": 234,
    "2b8h+": 235,
    "6g7f": 236,
    "P*2g": 237,
    "6b7a": 238,
    "2e2f": 239,
    "8f8b": 240,
    "5d5c+": 241,
    "6h5h": 242,
    "P*7c": 243,
    "2b3b": 244,
    "7g8h": 245,
    "4d3c": 246,
    "5f5g+": 247,
    "6c7d": 248,
    "P*4g": 249,
    "5f6e": 250,
    "5d4e": 251,
    "8h9g": 252,
    "4f4g+": 253,
    "N*6f": 254,
    "6d6c+": 255,
    "P*9g": 256,
    "6f7g": 257,
    "B*6d": 258,
    "2b1c": 259,
    "5d6c": 260,
    "9e9f": 261,
    "5e4d": 262,
    "P*9f": 263,
    "1i1h": 264,
    "5d4c": 265,
    "P*1c": 266,
    "5f6g": 267,
    "B*4f": 268,
    "8b8c": 269,
    "1e1d": 270,
    "8h7h": 271,
    "2h2f": 272,
    "N*7e": 273,
    "3c2e": 274,
    "5e6d": 275,
    "9a9b": 276,
    "8h9i": 277,
    "N*8e": 278,
    "2h2g": 279,
    "4d3e": 280,
    "4d5c": 281,
    "N*4d": 282,
    "8b8d": 283,
    "5c4b": 284,
    "4h5h": 285,
    "4h3i": 286,
    "N*6d": 287,
    "6b5b": 288,
    "5e4f": 289,
    "6f7e": 290,
    "5g6h": 291,
    "5e6f": 292,
    "7g8e": 293,
    "4g3f": 294,
    "8b5b": 295,
    "4e3c+": 296,
    "3f2f": 297,
    "N*4f": 298,
    "N*2e": 299,
    "P*5b": 300,
    "N*3e": 301,
    "2h4h": 302,
    "3g2f": 303,
    "6a7a": 304,
    "P*6h": 305,
    "N*5d": 306,
    "N*5f": 307,
    "2d2f": 308,
    "6f5g": 309,
    "P*1d": 310,
    "4i3i": 311,
    "S*6g": 312,
    "6g7g": 313,
    "8b3b": 314,
    "9e9d": 315,
    "7b6b": 316,
    "6e7g+": 317,
    "3e4f": 318,
    "S*4c": 319,
    "P*8b": 320,
    "P*4b": 321,
    "S*5b": 322,
    "N*7f": 323,
    "4e5f": 324,
    "B*5f": 325,
    "4c5b": 326,
    "N*7d": 327,
    "2f3f": 328,
    "B*5d": 329,
    "6d7c": 330,
    "5f4g": 331,
    "6d5c": 332,
    "P*2h": 333,
    "8d7d": 334,
    "4c3c": 335,
    "N*3d": 336,
    "8f7f": 337,
    "2h7h": 338,
    "2b1a": 339,
    "4f3g": 340,
    "P*5h": 341,
    "6c5b": 342,
    "3c3b": 343,
    "7e6d": 344,
    "6g5g": 345,
    "3b3a": 346,
    "P*4h": 347,
    "2h6h": 348,
    "3d3f": 349,
    "9f9g+": 350,
    "6e7f": 351,
    "3h4h": 352,
    "4c4b": 353,
    "6a5a": 354,
    "3c4c": 355,
    "4f5g": 356,
    "4e3d": 357,
    "7h7i": 358,
    "6e5d": 359,
    "N*3f": 360,
    "S*7g": 361,
    "B*3c": 362,
    "3e4d": 363,
    "1e1f": 364,
    "6g6h": 365,
    "P*7b": 366,
    "N*8d": 367,
    "2c3d": 368,
    "3d4c": 369,
    "5c6b": 370,
    "S*7h": 371,
    "S*5c": 372,
    "P*3h": 373,
    "8i9g": 374,
    "4e5c+": 375,
    "B*7g": 376,
    "6h6i": 377,
    "4c5c": 378,
    "S*3c": 379,
    "2b4d": 380,
    "4b5a": 381,
    "4g5h": 382,
    "8b6b": 383,
    "S*4b": 384,
    "N*2f": 385,
    "S*6i": 386,
    "P*6b": 387,
    "8e7g+": 388,
    "4c3b": 389,
    "4b4a": 390,
    "8b9b": 391,
    "S*5h": 392,
    "2c3b": 393,
    "2h1h": 394,
    "7g6g": 395,
    "3d4e": 396,
    "2i2d": 397,
    "S*3b": 398,
    "8h2b+": 399,
    "B*4a": 400,
    "2e3c+": 401,
    "7g7h": 402,
    "5h5i": 403,
    "S*6c": 404,
    "S*4a": 405,
    "9h9g": 406,
    "P*1b": 407,
    "2d2i": 408,
    "4e5d": 409,
    "1d1c+": 410,
    "6h5i": 411,
    "8g7h": 412,
    "S*5g": 413,
    "2a1c": 414,
    "5c4c": 415,
    "6g5h": 416,
    "7c8d": 417,
    "S*6h": 418,
    "3e2d": 419,
    "6c5c": 420,
    "7e6f": 421,
    "P*3b": 422,
    "8h6f": 423,
    "3c5a": 424,
    "6g7h": 425,
    "2b2a+": 426,
    "3g4h": 427,
    "B*7a": 428,
    "S*4g": 429,
    "N*8f": 430,
    "P*9h": 431,
    "S*5e": 432,
    "2d3c": 433,
    "8g7f": 434,
    "B*6i": 435,
    "4g5g": 436,
    "5b5a": 437,
    "2f3e": 438,
    "4i5i": 439,
    "7g5i": 440,
    "8a8f": 441,
    "5b4a": 442,
    "7c6c": 443,
    "8f7g": 444,
    "G*7h": 445,
    "5a6a": 446,
    "B*6e": 447,
    "7e8f": 448,
    "5g6g": 449,
    "8f7e": 450,
    "G*6h": 451,
    "P*9d": 452,
    "P*7h": 453,
    "P*9c": 454,
    "R*2h": 455,
    "2f2g+": 456,
    "8h3c+": 457,
    "8a9c": 458,
    "R*8b": 459,
    "2b1b": 460,
    "R*4a": 461,
    "6e5f": 462,
    "7c6b": 463,
    "5b6a": 464,
    "5g4h": 465,
    "B*3i": 466,
    "6e7d": 467,
    "1b1c": 468,
    "3g4g": 469,
    "6c6b": 470,
    "4a5a": 471,
    "4g4h": 472,
    "8b9a": 473,
    "7f6e": 474,
    "2d3e": 475,
    "B*3g": 476,
    "G*3b": 477,
    "2h1i": 478,
    "B*4e": 479,
    "6e5g+": 480,
    "5h6i": 481,
    "S*7b": 482,
    "8f8a": 483,
    "G*4b": 484,
    "S*4d": 485,
    "S*3d": 486,
    "6b6a": 487,
    "S*6d": 488,
    "S*8h": 489,
    "3d2e": 490,
    "8d8c+": 491,
    "2c3c": 492,
    "S*8g": 493,
    "6i5i": 494,
    "4e3f": 495,
    "8g7g": 496,
    "G*6b": 497,
    "G*6g": 498,
    "3a6d": 499,
    "S*2c": 500,
    "2g3f": 501,
    "4g3h": 502,
    "1a1c": 503,
    "6c7b": 504,
    "9i9g": 505,
    "S*5f": 506,
    "7f6g": 507,
    "7d8d": 508,
    "9a9e": 509,
    "P*1g": 510,
    "5c5b": 511,
    "5c6c": 512,
    "7h6i": 513,
    "8h8i+": 514,
    "N*2d": 515,
    "6c7c": 516,
    "G*4c": 517,
    "S*7f": 518,
    "4h4i": 519,
    "R*6a": 520,
    "2i1g": 521,
    "S*6f": 522,
    "8h9h": 523,
    "9d9c+": 524,
    "S*7i": 525,
    "P*9b": 526,
    "2i2h": 527,
    "P*1f": 528,
    "5g5h": 529,
    "8a8b": 530,
    "R*6i": 531,
    "R*7a": 532,
    "S*4h": 533,
    "5i4i": 534,
    "8c7d": 535,
    "B*5c": 536,
    "3f4g": 537,
    "8b2b": 538,
    "B*5g": 539,
    "B*6c": 540,
    "3d2d": 541,
    "3f4e": 542,
    "4e5g+": 543,
    "6b5a": 544,
    "R*4i": 545,
    "S*2b": 546,
    "2b2a": 547,
    "1i1e": 548,
    "3d4d": 549,
    "S*7c": 550,
    "B*4c": 551,
    "S*6b": 552,
    "S*3h": 553,
    "6h4f": 554,
    "7d6e": 555,
    "3e2f": 556,
    "5g4g": 557,
    "7d6c": 558,
    "R*3i": 559,
    "B*4g": 560,
    "S*3a": 561,
    "S*5d": 562,
    "6e5c+": 563,
    "7i6i": 564,
    "2c2b": 565,
    "2c2b+": 566,
    "S*7a": 567,
    "9a9c": 568,
    "B*2b": 569,
    "B*2g": 570,
    "S*3e": 571,
    "B*6a": 572,
    "S*7e": 573,
    "3h3i": 574,
    "2f2d": 575,
    "8b7a": 576,
    "B*7d": 577,
    "G*5h": 578,
    "R*8a": 579,
    "7f8e": 580,
    "B*4i": 581,
    "3a2a": 582,
    "3b4a": 583,
    "2h3g": 584,
    "G*7b": 585,
    "2a1a": 586,
    "5c5b+": 587,
    "8d7e": 588,
    "1i1g": 589,
    "7b6a": 590,
    "B*7c": 591,
    "7i4f": 592,
    "7e8d": 593,
    "8d8f": 594,
    "B*3h": 595,
    "P*1h": 596,
    "S*3g": 597,
    "8b7c": 598,
    "R*2i": 599,
    "G*5b": 600,
    "S*4e": 601,
    "9b9c": 602,
    "B*5i": 603,
    "B*8c": 604,
    "7f6f": 605,
    "3a4a": 606,
    "2h3i": 607,
    "2i1i": 608,
    "B*5a": 609,
    "S*6e": 610,
    "1f1g+": 611,
    "B*6g": 612,
    "B*8h": 613,
    "2a2b": 614,
    "4f6d": 615,
    "B*2h": 616,
    "S*4f": 617,
    "S*6a": 618,
    "3c7g+": 619,
    "4g3g": 620,
    "7c7b": 621,
    "G*7g": 622,
    "2f2h": 623,
    "7i8i": 624,
    "R*3a": 625,
    "5d4d": 626,
    "7f8f": 627,
    "3d2c": 628,
    "8a9a": 629,
    "3c2c": 630,
    "8b8a+": 631,
    "2h2i+": 632,
    "6d4f": 633,
    "9i8i": 634,
    "R*5i": 635,
    "G*4h": 636,
    "8a4a": 637,
    "B*3a": 638,
    "1a2a": 639,
    "2f2i": 640,
    "B*3e": 641,
    "P*9e": 642,
    "2b5e": 643,
    "5h4i": 644,
    "S*8c": 645,
    "2g3h": 646,
    "B*8b": 647,
    "B*7e": 648,
    "N*7g": 649,
    "2h2e": 650,
    "2i3i": 651,
    "3h4i": 652,
    "5g5h+": 653,
    "3g3h": 654,
    "4b6d": 655,
    "7g3c+": 656,
    "8c7b": 657,
    "B*7b": 658,
    "2f3g": 659,
    "7b8a": 660,
    "7g8g": 661,
    "8d8a": 662,
    "B*3d": 663,
    "S*7d": 664,
    "S*8b": 665,
    "3c5e": 666,
    "P*1e": 667,
    "R*2a": 668,
    "3d3c": 669,
    "4h5i": 670,
    "G*7i": 671,
    "P*5a": 672,
    "8h8i": 673,
    "P*3a": 674,
    "2a3a": 675,
    "7b7a": 676,
    "8i9i": 677,
    "1h1g": 678,
    "2g2h": 679,
    "8b8e": 680,
    "G*5g": 681,
    "3g2h": 682,
    "8g8h+": 683,
    "B*2f": 684,
    "2e3g+": 685,
    "G*5c": 686,
    "S*3f": 687,
    "5f6f": 688,
    "9g8h": 689,
    "L*8d": 690,
    "S*2g": 691,
    "3f2e": 692,
    "7h8i": 693,
    "8b9c": 694,
    "G*6c": 695,
    "P*5i": 696,
    "8d7c": 697,
    "2e3d": 698,
    "4c4b+": 699,
    "G*2b": 700,
    "R*5a": 701,
    "7f7d": 702,
    "B*8d": 703,
    "G*3a": 704,
    "3f4f": 705,
    "7f8g": 706,
    "8d8b": 707,
    "G*3c": 708,
    "2i6i": 709,
    "4d5d": 710,
    "6i7h+": 711,
    "4d6f": 712,
    "2g3g": 713,
    "5d6d": 714,
    "7d8e": 715,
    "B*3f": 716,
    "G*8h": 717,
    "L*5f": 718,
    "L*6d": 719,
    "7g5e": 720,
    "8g8h": 721,
    "G*3h": 722,
    "4b2b": 723,
    "B*7i": 724,
    "3c3b+": 725,
    "7d6d": 726,
    "8a7a": 727,
    "N*5g": 728,
    "8i8h": 729,
    "3i4i": 730,
    "6f4d": 731,
    "4d4c": 732,
    "6f6g": 733,
    "N*3c": 734,
    "1a1e": 735,
    "8c7c": 736,
    "P*4a": 737,
    "S*5a": 738,
    "6e7c+": 739,
    "7c8b": 740,
    "8e7c+": 741,
    "R*8i": 742,
    "7d7f": 743,
    "9g8f": 744,
    "7f7g": 745,
    "3c8h+": 746,
    "8i7i": 747,
    "3b2a": 748,
    "6c6b+": 749,
    "S*3i": 750,
    "S*4i": 751,
    "3f3d": 752,
    "5f4f": 753,
    "P*6i": 754,
    "1c2d": 755,
    "6f7f": 756,
    "L*4f": 757,
    "4f5f": 758,
    "9i9e": 759,
    "2d4f": 760,
    "N*5c": 761,
    "8e9g+": 762,
    "R*7i": 763,
    "2h1g": 764,
    "6f5f": 765,
    "8c8b": 766,
    "G*3d": 767,
    "N*7c": 768,
    "L*4d": 769,
    "2h8h": 770,
    "8a8d": 771,
    "S*2h": 772,
    "3h2i": 773,
    "3i2i": 774,
    "4d3d": 775,
    "7b7e": 776,
    "L*6f": 777,
    "3h3e": 778,
    "4g4h+": 779,
    "1c2b": 780,
    "2e3f": 781,
    "7a6a": 782,
    "8h5e": 783,
    "B*4b": 784,
    "S*8e": 785,
    "3c6f": 786,
    "7a8a": 787,
    "8e7d": 788,
    "B*7f": 789,
    "7g7h+": 790,
    "N*4c": 791,
    "4f3f": 792,
    "G*4g": 793,
    "N*8c": 794,
    "R*3h": 795,
    "2i5i": 796,
    "G*7e": 797,
    "4e3g+": 798,
    "8e7f": 799,
    "4a3b+": 800,
    "6d5d": 801,
    "B*2d": 802,
    "L*5d": 803,
    "L*8f": 804,
    "7d8c": 805,
    "G*4a": 806,
    "N*6c": 807,
    "2f2g": 808,
    "9i8h": 809,
    "G*6f": 810,
    "L*2f": 811,
    "N*3g": 812,
    "2e2i": 813,
    "L*2d": 814,
    "G*6i": 815,
    "G*7a": 816,
    "P*7i": 817,
    "S*2e": 818,
    "S*5i": 819,
    "S*8d": 820,
    "2i2f": 821,
    "7c8c": 822,
    "B*1e": 823,
    "2e1c+": 824,
    "5d5c": 825,
    "B*4h": 826,
    "L*5e": 827,
    "2f1e": 828,
    "3b3d": 829,
    "3f2g": 830,
    "N*4g": 831,
    "2a3b": 832,
    "6g6h+": 833,
    "7h7f": 834,
    "N*6g": 835,
    "R*2b": 836,
    "S*8f": 837,
    "B*5h": 838,
    "B*6b": 839,
    "N*9e": 840,
    "1i2i": 841,
    "G*3e": 842,
    "G*4d": 843,
    "G*5f": 844,
    "G*8g": 845,
    "1a2b": 846,
    "5f5g": 847,
    "6d7d": 848,
    "G*6e": 849,
    "G*7c": 850,
    "G*7f": 851,
    "8a8e": 852,
    "6d6c": 853,
    "8g9f": 854,
    "9a8a": 855,
    "S*2f": 856,
    "6h3e": 857,
    "7d7c": 858,
    "8d9e": 859,
    "B*3b": 860,
    "G*8b": 861,
    "8d8c": 862,
    "B*5b": 863,
    "G*7d": 864,
    "S*2d": 865,
    "3f3g": 866,
    "8i7h": 867,
    "B*9e": 868,
    "G*5d": 869,
    "3h3f": 870,
    "B*8g": 871,
    "2b4b": 872,
    "G*2c": 873,
    "P*4i": 874,
    "G*5e": 875,
    "P*6a": 876,
    "2c1d": 877,
    "3e2e": 878,
    "8a5a": 879,
    "8e7e": 880,
    "B*2e": 881,
    "N*1e": 882,
    "1a1d": 883,
    "G*4e": 884,
    "4f4g": 885,
    "8d5d": 886,
    "8f9e": 887,
    "P*3i": 888,
    "4f2d": 889,
    "L*7f": 890,
    "G*3i": 891,
    "1b2b": 892,
    "1c2c": 893,
    "2i2e": 894,
    "7g2b+": 895,
    "7g4d": 896,
    "B*7h": 897,
    "3g2g": 898,
    "5i2f": 899,
    "9i9f": 900,
    "B*6h": 901,
    "L*3d": 902,
    "2d1c": 903,
    "2i4i": 904,
    "4f6h": 905,
    "8f9g": 906,
    "G*3g": 907,
    "R*5h": 908,
    "2b6f": 909,
    "5i3g": 910,
    "G*6d": 911,
    "R*7b": 912,
    "2d1e": 913,
    "2f5f": 914,
    "4d2f": 915,
    "1c2e": 916,
    "R*8h": 917,
    "1e2d": 918,
    "B*2c": 919,
    "G*4f": 920,
    "5h5f": 921,
    "6f7h+": 922,
    "L*8e": 923,
    "R*4b": 924,
    "2c1b": 925,
    "L*4e": 926,
    "B*8f": 927,
    "G*8c": 928,
    "L*7e": 929,
    "9c8e": 930,
    "L*3c": 931,
    "R*3b": 932,
    "7i2d": 933,
    "9b8b": 934,
    "L*7g": 935,
    "2d2c": 936,
    "8g9h": 937,
    "G*6a": 938,
    "P*7a": 939,
    "R*5b": 940,
    "4d3b+": 941,
    "6d7f": 942,
    "G*4i": 943,
    "R*4h": 944,
    "3g3h+": 945,
    "6d8f": 946,
    "7e6e": 947,
    "7i5g": 948,
    "8a6a": 949,
    "1b2a": 950,
    "2f4d": 951,
    "L*6e": 952,
    "5e4e": 953,
    "7c7b+": 954,
    "7e8e": 955,
    "9a8b": 956,
    "G*5a": 957,
    "1e2f": 958,
    "5e6c+": 959,
    "8e8a": 960,
    "G*3f": 961,
    "L*5i": 962,
    "2e3e": 963,
    "9e8d": 964,
    "L*7d": 965,
    "N*4a": 966,
    "5a7c": 967,
    "8f6d": 968,
    "9a9d": 969,
    "B*1f": 970,
    "6d4b": 971,
    "6h8f": 972,
    "8h4d": 973,
    "N*9d": 974,
    "4e5e": 975,
    "L*2e": 976,
    "L*3e": 977,
    "L*5a": 978,
    "B*1d": 979,
    "G*2g": 980,
    "8d2d": 981,
    "9g8g": 982,
    "9h8h": 983,
    "B*8e": 984,
    "G*5i": 985,
    "4b2d": 986,
    "4b7e": 987,
    "L*8c": 988,
    "N*2g": 989,
    "4d3c+": 990,
    "9g8e": 991,
    "R*6b": 992,
    "1g2e": 993,
    "4h2h": 994,
    "L*4g": 995,
    "2i2g": 996,
    "3a5c": 997,
    "4a8a": 998,
    "8d6d": 999,
    "N*6h": 1000,
    "1b2c": 1001,
    "2g2h+": 1002,
    "3d4b+": 1003,
    "3h3i+": 1004,
    "5e4c+": 1005,
    "7i3e": 1006,
    "8a2a": 1007,
    "8f8g": 1008,
    "1i1f": 1009,
    "G*2h": 1010,
    "R*7h": 1011,
    "5h5e": 1012,
    "G*2d": 1013,
    "1h2h": 1014,
    "6f8d": 1015,
    "7b7a+": 1016,
    "9e8f": 1017,
    "L*4i": 1018,
    "2d2a+": 1019,
    "3e4e": 1020,
    "5f3d": 1021,
    "2e2h": 1022,
    "4e3e": 1023,
    "5a8d": 1024,
    "5e4g+": 1025,
    "G*8d": 1026,
    "2h1i+": 1027,
    "5h5d": 1028,
    "8e9c+": 1029,
    "9c8d": 1030,
    "3f5f": 1031,
    "5b5d": 1032,
    "6e5e": 1033,
    "8a8c": 1034,
    "2f3d": 1035,
    "8e8b": 1036,
    "G*8e": 1037,
    "1g2h": 1038,
    "4h4f": 1039,
    "N*5a": 1040,
    "R*6h": 1041,
    "2f1f": 1042,
    "3d2b+": 1043,
    "8a7b": 1044,
    "B*9d": 1045,
    "L*3f": 1046,
    "9h8i": 1047,
    "N*1f": 1048,
    "2i8i": 1049,
    "4b4d": 1050,
    "6h2d": 1051,
    "7f6h+": 1052,
    "6a7b+": 1053,
    "7a6b+": 1054,
    "N*6b": 1055,
    "S*8i": 1056,
    "5d5f": 1057,
    "B*2a": 1058,
    "G*2f": 1059,
    "N*4b": 1060,
    "5e6g+": 1061,
    "8d7f": 1062,
    "9c8c": 1063,
    "B*9b": 1064,
    "3b3f": 1065,
    "5e6e": 1066,
    "8d6f": 1067,
    "1c1b+": 1068,
    "5e7g": 1069,
    "5f5d": 1070,
    "6e7e": 1071,
    "6f7g+": 1072,
    "7b7d": 1073,
    "9g9h+": 1074,
    "B*1h": 1075,
    "1i2h": 1076,
    "2a1b": 1077,
    "2e1g+": 1078,
    "3d2c+": 1079,
    "9c8b": 1080,
    "L*4a": 1081,
    "N*8g": 1082,
    "4d7g+": 1083,
    "N*2c": 1084,
    "5d7f": 1085,
    "8c8b+": 1086,
    "9h8g": 1087,
    "N*3a": 1088,
    "N*7i": 1089,
    "2c1c": 1090,
    "2d7d": 1091,
    "5b5a+": 1092,
    "B*9f": 1093,
    "G*8f": 1094,
    "3b5b": 1095,
    "3c1e": 1096,
    "4h4e": 1097,
    "8d9c": 1098,
    "8i9h": 1099,
    "L*3i": 1100,
    "L*6b": 1101,
    "4b8f": 1102,
    "8c9b": 1103,
    "9a9f": 1104,
    "3f4g+": 1105,
    "4h4i+": 1106,
    "5d6f": 1107,
    "6b6a+": 1108,
    "B*8i": 1109,
    "L*2g": 1110,
    "L*6c": 1111,
    "N*6i": 1112,
    "2b2d": 1113,
    "4d2b": 1114,
    "4d5c+": 1115,
    "6b6d": 1116,
    "7f8h+": 1117,
    "L*4c": 1118,
    "L*5g": 1119,
    "4f5g+": 1120,
    "6f3c+": 1121,
    "8b9a+": 1122,
    "8d9d": 1123,
    "L*7a": 1124,
    "2d2b+": 1125,
    "4f3d": 1126,
    "6d7c+": 1127,
    "1g2g": 1128,
    "2f4f": 1129,
    "2i3h": 1130,
    "3g5e": 1131,
    "4f3g+": 1132,
    "B*9c": 1133,
    "L*6a": 1134,
    "2d1d": 1135,
    "2g1h": 1136,
    "4f3h+": 1137,
    "7d6c+": 1138,
    "L*5b": 1139,
    "6h6i+": 1140,
    "8c9d": 1141,
    "5d3f": 1142,
    "5e3c": 1143,
    "5f6h+": 1144,
    "B*1c": 1145,
    "P*2i": 1146,
    "S*2a": 1147,
    "2f1g": 1148,
    "B*9g": 1149,
    "G*8i": 1150,
    "N*5i": 1151,
    "N*9f": 1152,
    "8c9c": 1153,
    "G*2e": 1154,
    "L*5c": 1155,
    "N*5b": 1156,
    "L*5h": 1157,
    "N*1d": 1158,
    "2b1a+": 1159,
    "7d5d": 1160,
    "8h6h": 1161,
    "R*1h": 1162,
    "4a4d": 1163,
    "5f4d": 1164,
    "5g7e": 1165,
    "5h2h": 1166,
    "6b8b": 1167,
    "6h8h": 1168,
    "8b8g+": 1169,
    "8g9g": 1170,
    "N*5h": 1171,
    "1i1d": 1172,
    "2d3c+": 1173,
    "2f7f": 1174,
    "2g2d": 1175,
    "3d5d": 1176,
    "5h5i+": 1177,
    "6b6e": 1178,
    "7f8g+": 1179,
    "P*2a": 1180,
    "2d4b": 1181,
    "3d4c+": 1182,
    "5e2b": 1183,
    "6h6f": 1184,
    "7e6c+": 1185,
    "7f5f": 1186,
    "7h7d": 1187,
    "8a3a": 1188,
    "8f7h+": 1189,
    "1d2c": 1190,
    "3g6d": 1191,
    "6d6f": 1192,
    "L*6h": 1193,
    "S*9g": 1194,
    "1d2e": 1195,
    "2g1f": 1196,
    "2h2c+": 1197,
    "3e6h": 1198,
    "4d5b+": 1199,
    "6d5c+": 1200,
    "6f8h": 1201,
    "8e9f": 1202,
    "L*7i": 1203,
    "N*4h": 1204,
    "1g2f": 1205,
    "3b3a+": 1206,
    "4f5h+": 1207,
    "5c7e": 1208,
    "6f6d": 1209,
    "7g9e": 1210,
    "8c7d+": 1211,
    "8d3d": 1212,
    "8f8h+": 1213,
    "9b8a": 1214,
    "L*6g": 1215,
    "L*8g": 1216,
    "R*1b": 1217,
    "5a5d": 1218,
    "6d7b+": 1219,
    "6i2i": 1220,
    "7f6g+": 1221,
    "8f6h": 1222,
    "B*1b": 1223,
    "B*1g": 1224,
    "L*2i": 1225,
    "L*4h": 1226,
    "L*8b": 1227,
    "R*2g": 1228,
    "R*9b": 1229,
    "3d7d": 1230,
    "4b4a+": 1231,
    "5d4b+": 1232,
    "5f6d": 1233,
    "6a5b+": 1234,
    "6c7d+": 1235,
    "7e6g+": 1236,
    "L*2c": 1237,
    "1b1a+": 1238,
    "5b5e": 1239,
    "5e3g": 1240,
    "5h7h": 1241,
    "5i5f": 1242,
    "9g7e": 1243,
    "B*9h": 1244,
    "L*7c": 1245,
    "2g3f+": 1246,
    "5a3c": 1247,
    "5e9i+": 1248,
    "5f5i": 1249,
    "8d7c+": 1250,
    "8e9d": 1251,
    "G*2a": 1252,
    "L*6i": 1253,
    "L*8a": 1254,
    "3d5f": 1255,
    "3i4h+": 1256,
    "4a5b+": 1257,
    "4d8h+": 1258,
    "5e7g+": 1259,
    "5i2i": 1260,
    "7a8b+": 1261,
    "7c5e": 1262,
    "7f3f": 1263,
    "2d4d": 1264,
    "4i3h+": 1265,
    "7e7b": 1266,
    "8h8d": 1267,
    "N*7a": 1268,
    "3a7e": 1269,
    "3e4c+": 1270,
    "4a6c+": 1271,
    "5b5f": 1272,
    "6i6f": 1273,
    "7h7i+": 1274,
    "L*3a": 1275,
    "N*6a": 1276,
    "3f4h+": 1277,
    "5e7c": 1278,
    "L*4b": 1279,
    "N*3h": 1280,
    "4f5d": 1281,
    "5a8a": 1282,
    "5d6b+": 1283,
    "5f7f": 1284,
    "5g3e": 1285,
    "6d3g+": 1286,
    "6f1a+": 1287,
    "6f5d": 1288,
    "8f8c": 1289,
    "8h8f": 1290,
    "9f8g": 1291,
    "L*3g": 1292,
    "R*9h": 1293,
    "4d6b": 1294,
    "5a4b+": 1295,
    "5f3f": 1296,
    "5f7d": 1297,
    "5i5e": 1298,
    "6f2b+": 1299,
    "6f5g+": 1300,
    "7a5c+": 1301,
    "7b5b": 1302,
    "8h9i+": 1303,
    "9c9b": 1304,
    "1c1b": 1305,
    "2f2c+": 1306,
    "4f4d": 1307,
    "5d5i": 1308,
    "5e3c+": 1309,
    "8c8a": 1310,
    "R*8c": 1311,
    "S*1g": 1312,
    "2a4a": 1313,
    "3e2c+": 1314,
    "3f4d": 1315,
    "5d3d": 1316,
    "5e1a+": 1317,
    "6d5b+": 1318,
    "6f4h": 1319,
    "7d6f": 1320,
    "8f8i+": 1321,
    "9f8e": 1322,
    "9g6d": 1323,
    "9g9h": 1324,
    "L*9f": 1325,
    "N*7b": 1326,
    "S*1c": 1327,
    "1i4f": 1328,
    "2b5b": 1329,
    "2d5d": 1330,
    "2e1f": 1331,
    "2e8e": 1332,
    "2f3g+": 1333,
    "2i7i": 1334,
    "4a4c": 1335,
    "5i6h+": 1336,
    "7d6b+": 1337,
    "8f9f": 1338,
    "9d8c": 1339,
    "1h2i": 1340,
    "2i1i+": 1341,
    "3a2b+": 1342,
    "3e4g+": 1343,
    "4c3b+": 1344,
    "5b4c+": 1345,
    "5d4f": 1346,
    "5e1i+": 1347,
    "5i7g": 1348,
    "7g1a+": 1349,
    "S*9e": 1350,
    "1f2e": 1351,
    "3e3h": 1352,
    "3h5h": 1353,
    "4g3f+": 1354,
    "5a5c": 1355,
    "5b2b": 1356,
    "5f6g+": 1357,
    "6i5h+": 1358,
    "8c8f": 1359,
    "8f6f": 1360,
    "9c9b+": 1361,
    "S*1b": 1362,
    "1h1e": 1363,
    "3i2h+": 1364,
    "5e3g+": 1365,
    "5f2f": 1366,
    "6d1i+": 1367,
    "6g7h+": 1368,
    "7h5h": 1369,
    "8f7g+": 1370,
    "9b8c": 1371,
    "S*9c": 1372,
    "1c4f": 1373,
    "1f2f": 1374,
    "2a5a": 1375,
    "2e1d": 1376,
    "7e2e": 1377,
    "7h7e": 1378,
    "L*2h": 1379,
    "R*9a": 1380,
    "2d2g": 1381,
    "3a4b+": 1382,
    "4b4e": 1383,
    "4b4f": 1384,
    "4f1i+": 1385,
    "5e5i": 1386,
    "6a8a": 1387,
    "7e8g+": 1388,
    "L*9g": 1389,
    "N*4i": 1390,
    "N*7h": 1391,
    "2e4e": 1392,
    "3d8d": 1393,
    "4f7c+": 1394,
    "4i4f": 1395,
    "5f4g+": 1396,
    "5i5g": 1397,
    "9a9g+": 1398,
    "B*8a": 1399,
    "2a8a": 1400,
    "2i2c+": 1401,
    "3f5d": 1402,
    "3f7f": 1403,
    "5b3b": 1404,
    "5b8b": 1405,
    "8a9b": 1406,
    "L*1d": 1407,
    "R*5c": 1408,
    "1c3e": 1409,
    "3f2d": 1410,
    "4i2i": 1411,
    "4i4g": 1412,
    "5h3h": 1413,
    "8b7c+": 1414,
    "8c8e": 1415,
    "8d8g+": 1416,
    "8e6e": 1417,
    "L*8h": 1418,
    "R*9i": 1419,
    "S*9h": 1420,
    "2i1h": 1421,
    "3e5g": 1422,
    "4b6b": 1423,
    "5b6c+": 1424,
    "5c8f": 1425,
    "5d7d": 1426,
    "5f4h+": 1427,
    "6d5f": 1428,
    "6f7d": 1429,
    "7b6c+": 1430,
    "7e4b": 1431,
    "7f5d": 1432,
    "8d4d": 1433,
    "8e2e": 1434,
    "8f7d": 1435,
    "1g1h": 1436,
    "2c2a": 1437,
    "2f6f": 1438,
    "4d9i+": 1439,
    "5c3e": 1440,
    "5g2d": 1441,
    "5h8h": 1442,
    "6h6e": 1443,
    "6i6g": 1444,
    "7e5c": 1445,
    "8d7b+": 1446,
    "P*8a": 1447,
    "1g1h+": 1448,
    "2e1e": 1449,
    "3g5i": 1450,
    "3h4g+": 1451,
    "4g5f+": 1452,
    "5g8d": 1453,
    "6f5h+": 1454,
    "7d5f": 1455,
    "7d8f": 1456,
    "8a8g+": 1457,
    "8f5f": 1458,
    "8i9i+": 1459,
    "L*9b": 1460,
    "L*9d": 1461,
    "R*1i": 1462,
    "1b1a": 1463,
    "2b2f": 1464,
    "2d3b+": 1465,
    "2g2i": 1466,
    "3i6i": 1467,
    "4h4d": 1468,
    "4i5h+": 1469,
    "5c2f": 1470,
    "5d4c+": 1471,
    "5g6h+": 1472,
    "5h6g+": 1473,
    "8a9a+": 1474,
    "8e9e": 1475,
    "9b9e": 1476,
    "9h9i+": 1477,
    "R*2e": 1478,
    "S*9f": 1479,
    "1e1c+": 1480,
    "4d4f": 1481,
    "5d2d": 1482,
    "5d5g+": 1483,
    "5g6f+": 1484,
    "6f9i+": 1485,
    "6g7f+": 1486,
    "8d9f": 1487,
    "8i7h+": 1488,
    "9d8e": 1489,
    "L*1i": 1490,
    "L*9a": 1491,
    "N*3b": 1492,
    "N*3i": 1493,
    "R*6c": 1494,
    "R*8d": 1495,
    "3b3e": 1496,
    "3c9i+": 1497,
    "3h4i+": 1498,
    "7b8c+": 1499,
    "9e9g+": 1500,
    "1f2g": 1501,
    "1i1c+": 1502,
    "2a1a+": 1503,
    "2b3c+": 1504,
    "2b6b": 1505,
    "2d8d": 1506,
    "2g1g": 1507,
    "3g4f+": 1508,
    "4d4a": 1509,
    "7d3d": 1510,
    "7i6h+": 1511,
    "G*9g": 1512,
    "L*1a": 1513,
    "L*1f": 1514,
    "R*4g": 1515,
    "R*8e": 1516,
    "2d2b": 1517,
    "2e2c+": 1518,
    "3a8f": 1519,
    "4d1a+": 1520,
    "5a2a": 1521,
    "7a8a+": 1522,
    "7d2d": 1523,
    "7d8c+": 1524,
    "7e5c+": 1525,
    "8h5h": 1526,
    "9f8f": 1527,
    "L*9i": 1528,
    "N*8i": 1529,
    "2c3d+": 1530,
    "2d6h": 1531,
    "2f3h+": 1532,
    "2f8f": 1533,
    "4d3f": 1534,
    "4h6f": 1535,
    "5d8d": 1536,
    "5i4h+": 1537,
    "6a6d": 1538,
    "6b4d": 1539,
    "7e8c+": 1540,
    "8h7g+": 1541,
    "G*2i": 1542,
    "L*7b": 1543,
    "L*9h": 1544,
    "N*8h": 1545,
    "S*8a": 1546,
    "2a3b+": 1547,
    "2d2g+": 1548,
    "2e7e": 1549,
    "2g2e": 1550,
    "4f9a+": 1551,
    "5d6c+": 1552,
    "5e9a+": 1553,
    "5f8f": 1554,
    "8i5i": 1555,
    "8i8g": 1556,
    "N*2i": 1557,
    "R*1a": 1558,
    "1a4d": 1559,
    "1d2d": 1560,
    "1h1i": 1561,
    "2a2d": 1562,
    "3e8e": 1563,
    "3f8f": 1564,
    "4b7b": 1565,
    "4h6h": 1566,
    "5f5c+": 1567,
    "5g3i": 1568,
    "7c4f": 1569,
    "8e3e": 1570,
    "8g7f+": 1571,
    "9h9f": 1572,
    "9i9d": 1573,
    "L*3b": 1574,
    "L*9e": 1575,
    "N*2b": 1576,
    "R*2c": 1577,
    "1i5e": 1578,
    "3d6d": 1579,
    "3f2g+": 1580,
    "3f3i": 1581,
    "4d5f": 1582,
    "4f2f": 1583,
    "4g6e": 1584,
    "4i4e": 1585,
    "6b4b": 1586,
    "6d9a+": 1587,
    "6e8e": 1588,
    "7b8a+": 1589,
    "8e5e": 1590,
    "8i6i": 1591,
    "9b9a": 1592,
    "L*2b": 1593,
    "L*9c": 1594,
    "R*2f": 1595,
    "1e2c+": 1596,
    "1h1i+": 1597,
    "1i6d": 1598,
    "2d3f": 1599,
    "3h2i+": 1600,
    "3i5g+": 1601,
    "5a6b+": 1602,
    "5c4d+": 1603,
    "6i4g+": 1604,
    "7a4a": 1605,
    "7c5a": 1606,
    "7f2f": 1607,
    "1h2g": 1608,
    "2d6d": 1609,
    "3d3b+": 1610,
    "3h3d": 1611,
    "4a6a": 1612,
    "4d2d": 1613,
    "5c6a+": 1614,
    "5e5a": 1615,
    "5e7c+": 1616,
    "6b5c+": 1617,
    "8g7h+": 1618,
    "9a6d": 1619,
    "9d8d": 1620,
    "L*7h": 1621,
    "L*8i": 1622,
    "R*4e": 1623,
    "R*5e": 1624,
    "3f1f": 1625,
    "3h2g+": 1626,
    "3h6h": 1627,
    "4c3d+": 1628,
    "5b7b": 1629,
    "6d8d": 1630,
    "6h4h": 1631,
    "6h6d": 1632,
    "8e8g+": 1633,
    "8g8i": 1634,
    "L*1b": 1635,
    "N*2a": 1636,
    "R*6g": 1637,
    "R*8g": 1638,
    "1a1f": 1639,
    "1a3c": 1640,
    "3e5e": 1641,
    "3f2h+": 1642,
    "3i5i": 1643,
    "4c5d+": 1644,
    "4e2e": 1645,
    "4g4i": 1646,
    "5c4b+": 1647,
    "6c5d+": 1648,
    "6f6i": 1649,
    "7a7d": 1650,
    "7b7f": 1651,
    "7c6d+": 1652,
    "7d8b+": 1653,
    "8i8f": 1654,
    "B*9i": 1655,
    "L*3h": 1656,
    "P*8i": 1657,
    "2c3b+": 1658,
    "3b6b": 1659,
    "3e3c+": 1660,
    "3e5c": 1661,
    "3i3g": 1662,
    "4a4e": 1663,
    "4b1e": 1664,
    "4b3c+": 1665,
    "5a5e": 1666,
    "5c6d+": 1667,
    "5i7i": 1668,
    "6c4a": 1669,
    "7d7a": 1670,
    "7e5e": 1671,
    "8e8c": 1672,
    "8f3f": 1673,
    "B*1a": 1674,
    "S*9b": 1675,
    "1c3a": 1676,
    "1i3g": 1677,
    "2g3h+": 1678,
    "3b2a+": 1679,
    "3e5g+": 1680,
    "4d7a": 1681,
    "4i6i": 1682,
    "6a4c+": 1683,
    "6a8a+": 1684,
    "6i6e": 1685,
    "7b4b": 1686,
    "8a1a": 1687,
    "9b9d": 1688,
    "9g7i": 1689,
    "G*9h": 1690,
    "R*5g": 1691,
    "S*9d": 1692,
    "1e3g+": 1693,
    "3b4c+": 1694,
    "3f6f": 1695,
    "4a2c+": 1696,
    "4e5c": 1697,
    "4e6e": 1698,
    "4h2f": 1699,
    "5i3i": 1700,
    "6a6c": 1701,
    "6a6e": 1702,
    "6c4e": 1703,
    "6i8i+": 1704,
    "7f4f": 1705,
    "7f6d": 1706,
    "7i8h+": 1707,
    "9h9i": 1708,
    "G*8a": 1709,
    "1h4h": 1710,
    "2d5g+": 1711,
    "2f5c+": 1712,
    "2g5d": 1713,
    "2h3g+": 1714,
    "4a2a": 1715,
    "4e4c+": 1716,
    "5a2d": 1717,
    "5h4g+": 1718,
    "5i8i": 1719,
    "6b8d": 1720,
    "7d4d": 1721,
    "7e5g": 1722,
    "9b6b": 1723,
    "9i7g": 1724,
    "L*1h": 1725,
    "R*4f": 1726,
    "1h5h": 1727,
    "1i4i": 1728,
    "3i3e": 1729,
    "5i3g+": 1730,
    "7d9d": 1731,
    "8f5i": 1732,
    "9e8g+": 1733,
    "9i9c+": 1734,
    "B*1i": 1735,
    "G*9b": 1736,
    "L*1e": 1737,
    "N*9c": 1738,
    "R*5f": 1739,
    "1a1g+": 1740,
    "1d1c": 1741,
    "2b9i+": 1742,
    "2d5a": 1743,
    "2f1d": 1744,
    "3a2a+": 1745,
    "3a3c": 1746,
    "3d3b": 1747,
    "3e5c+": 1748,
    "3f3h": 1749,
    "4c7f": 1750,
    "4e4i": 1751,
    "5e8h": 1752,
    "5i5d": 1753,
    "6d6g+": 1754,
    "7a7c": 1755,
    "8c6c": 1756,
    "8d6b": 1757,
    "9a4a": 1758,
    "9e9c+": 1759,
    "9f9g": 1760,
    "B*2i": 1761,
    "G*1b": 1762,
    "1g1e": 1763,
    "2a6a": 1764,
    "2b2e": 1765,
    "2e2g": 1766,
    "2f5i": 1767,
    "3b2c+": 1768,
    "3e3i": 1769,
    "3g2f+": 1770,
    "3i6f+": 1771,
    "4a7a": 1772,
    "4i6g+": 1773,
    "4i7i": 1774,
    "5e5c+": 1775,
    "5g4f+": 1776,
    "5g5e": 1777,
    "6b6f": 1778,
    "6b9b": 1779,
    "6c6a": 1780,
    "6f3i": 1781,
    "7c9e": 1782,
    "7f7i": 1783,
    "8a6c": 1784,
    "9b9f": 1785,
    "9i5e": 1786,
    "G*1c": 1787,
    "L*1c": 1788,
    "L*1g": 1789,
    "R*4c": 1790,
    "S*1d": 1791,
    "2d4b+": 1792,
    "2h4f": 1793,
    "3i2i+": 1794,
    "4f4h": 1795,
    "4f4i": 1796,
    "4f6f": 1797,
    "4h1h": 1798,
    "5a3a": 1799,
    "5d5a": 1800,
    "5i8f": 1801,
    "6c5b+": 1802,
    "6c7b+": 1803,
    "6d8b": 1804,
    "7e7g+": 1805,
    "8d5g+": 1806,
    "9b5b": 1807,
    "9b9a+": 1808,
    "9i6f": 1809,
    "R*7e": 1810,
    "R*7f": 1811,
    "1a5e": 1812,
    "1g4d": 1813,
    "3e6e": 1814,
    "4i2g+": 1815,
    "4i2i+": 1816,
    "5e3e": 1817,
    "6a4a": 1818,
    "6d4d": 1819,
    "6e4c+": 1820,
    "6h9e": 1821,
    "7a5a": 1822,
    "7a5c": 1823,
    "7h6g+": 1824,
    "8e4e": 1825,
    "8f8i": 1826,
    "N*8a": 1827,
    "S*1e": 1828,
    "S*1h": 1829,
    "1b1d": 1830,
    "2e2i+": 1831,
    "2f4h": 1832,
    "2g4g": 1833,
    "2g4i": 1834,
    "3e2g+": 1835,
    "3g1e": 1836,
    "3h7h": 1837,
    "3i1i+": 1838,
    "4c4a": 1839,
    "4f2h": 1840,
    "5e8h+": 1841,
    "5g4i+": 1842,
    "6g4e": 1843,
    "6i4i": 1844,
    "7b9b": 1845,
    "7f7h+": 1846,
    "8b6d": 1847,
    "8c5c": 1848,
    "8h1a+": 1849,
    "8i2i": 1850,
    "9d9c": 1851,
    "N*9g": 1852,
    "R*2d": 1853,
    "R*3d": 1854,
    "R*5d": 1855,
    "S*2i": 1856,
    "1a4a": 1857,
    "1e2e": 1858,
    "1g3e": 1859,
    "1i5i": 1860,
    "3a5a": 1861,
    "3a5c+": 1862,
    "3d1d": 1863,
    "3i3f": 1864,
    "3i5g": 1865,
    "3i6f": 1866,
    "3i7e+": 1867,
    "4c6e": 1868,
    "4f4c+": 1869,
    "4h3g+": 1870,
    "5c7a": 1871,
    "5e2e": 1872,
    "5f7h": 1873,
    "6d3g": 1874,
    "6e2e": 1875,
    "6e6g+": 1876,
    "6i3i": 1877,
    "6i6d": 1878,
    "6i8i": 1879,
    "7a4d+": 1880,
    "7i8i+": 1881,
    "8d8a+": 1882,
    "8f5c+": 1883,
    "9a7c": 1884,
    "9e7c+": 1885,
    "G*1e": 1886,
    "N*8b": 1887,
    "1f1g": 1888,
    "1i6i": 1889,
    "2i4g": 1890,
    "3c1a": 1891,
    "3f5h": 1892,
    "3g1i": 1893,
    "4b5c+": 1894,
    "4f4h+": 1895,
    "4f6h+": 1896,
    "4f7i": 1897,
    "4g5h+": 1898,
    "4h5g+": 1899,
    "5a7c+": 1900,
    "5c3a": 1901,
    "5d5b": 1902,
    "6e7g": 1903,
    "6i8g+": 1904,
    "7c7a": 1905,
    "7e4e": 1906,
    "7h8i+": 1907,
    "7i7g": 1908,
    "8e8c+": 1909,
    "8f4f": 1910,
    "8f8c+": 1911,
    "8i6g": 1912,
    "R*3e": 1913,
    "2a2c": 1914,
    "2f2i+": 1915,
    "3a6a": 1916,
    "3e7e": 1917,
    "4b8b": 1918,
    "4g6i": 1919,
    "4i7f+": 1920,
    "5c5a": 1921,
    "5d2g+": 1922,
    "5f3h": 1923,
    "5g6e": 1924,
    "5g7i": 1925,
    "6d3a": 1926,
    "6e6c+": 1927,
    "6f6c+": 1928,
    "7g8i+": 1929,
    "7h8g+": 1930,
    "8c7b+": 1931,
    "9a5a": 1932,
    "9a5e": 1933,
    "9c9e": 1934,
    "N*2h": 1935,
    "R*3c": 1936,
    "R*3f": 1937,
    "R*7d": 1938,
    "S*1f": 1939,
    "1a3a": 1940,
    "1d1b+": 1941,
    "1h3h": 1942,
    "2c2e": 1943,
    "2e2a+": 1944,
    "2e5e": 1945,
    "3d1f": 1946,
    "3e1g": 1947,
    "3f1d": 1948,
    "3i7i": 1949,
    "4a2a+": 1950,
    "4g3e": 1951,
    "4h7h": 1952,
    "4i1i": 1953,
    "5g5i": 1954,
    "6c3f": 1955,
    "6d6a": 1956,
    "6f9c+": 1957,
    "6g5f+": 1958,
    "6g6i": 1959,
    "7f8d": 1960,
    "7f9f": 1961,
    "7h4h": 1962,
    "8f4b+": 1963,
    "8i4i": 1964,
    "9f8h+": 1965,
    "G*9f": 1966,
    "N*1c": 1967,
    "R*6d": 1968,
    "R*7c": 1969,
    "1a6f": 1970,
    "1e1a+": 1971,
    "1e1g+": 1972,
    "1f3d": 1973,
    "2e6e": 1974,
    "4c5b+": 1975,
    "4d7g": 1976,
    "4e2g+": 1977,
    "4f7f": 1978,
    "4g4e": 1979,
    "4h7e": 1980,
    "4i4d": 1981,
    "5c6b+": 1982,
    "5e2b+": 1983,
    "5e7e": 1984,
    "5g5d": 1985,
    "6a8c+": 1986,
    "6d6b+": 1987,
    "6e8c+": 1988,
    "6g6e": 1989,
    "7a4d": 1990,
    "7i4i": 1991,
    "7i7f": 1992,
    "8c6a": 1993,
    "8c7e": 1994,
    "8c8g+": 1995,
    "G*1h": 1996,
    "L*2a": 1997,
    "R*6e": 1998,
    "1c5g+": 1999,
    "1e1b+": 2000,
    "2d1f": 2001,
    "2d2a": 2002,
    "2d5g": 2003,
    "2d6h+": 2004,
    "2e3c": 2005,
    "2g4i+": 2006,
    "3a3d": 2007,
    "3c3a": 2008,
    "3d4f": 2009,
    "3e3b+": 2010,
    "3h1h": 2011,
    "3i1i": 2012,
    "4c6a": 2013,
    "4f4i+": 2014,
    "4g3h+": 2015,
    "4g4d": 2016,
    "5e5g+": 2017,
    "5f5h": 2018,
    "5f5h+": 2019,
    "6a9a+": 2020,
    "6b7c+": 2021,
    "6c7e": 2022,
    "6e6a": 2023,
    "6h7g+": 2024,
    "6i3f+": 2025,
    "7a9a+": 2026,
    "7c3g+": 2027,
    "7d4g+": 2028,
    "7i5i": 2029,
    "7i9g": 2030,
    "8d5g": 2031,
    "8d8b+": 2032,
    "9a6a": 2033,
    "9d8f": 2034,
    "9d9f": 2035,
    "9e8e": 2036,
    "P*1a": 2037,
    "P*9i": 2038,
    "1e3c+": 2039,
    "2a7a": 2040,
    "2f6b+": 2041,
    "2i9i": 2042,
    "3a8a": 2043,
    "3e6h+": 2044,
    "3f1h": 2045,
    "4d2b+": 2046,
    "4e6c": 2047,
    "5b6a+": 2048,
    "6b3e": 2049,
    "6f8f": 2050,
    "6g5h+": 2051,
    "6h3h": 2052,
    "6h5g+": 2053,
    "7e7a": 2054,
    "7f7h": 2055,
    "9f9h+": 2056,
    "9h9e": 2057,
    "N*1g": 2058,
    "R*4d": 2059,
    "1e1h+": 2060,
    "2a3a+": 2061,
    "2a4c": 2062,
    "2f2a+": 2063,
    "2f4h+": 2064,
    "2h5e": 2065,
    "3c2a+": 2066,
    "4a9a": 2067,
    "4c4e": 2068,
    "5f2c+": 2069,
    "6c8e": 2070,
    "6d3d": 2071,
    "6d6a+": 2072,
    "6d9g+": 2073,
    "6h2h": 2074,
    "6i4i+": 2075,
    "7g6f+": 2076,
    "7i2i": 2077,
    "8a8b+": 2078,
    "8b5e": 2079,
    "8c5f": 2080,
    "8c9a+": 2081,
    "8d5a": 2082,
    "8e7g": 2083,
    "8f8h": 2084,
    "9c6f": 2085,
    "G*1g": 2086,
    "G*9c": 2087,
    "S*1a": 2088,
    "1d1f": 2089,
    "1e3c": 2090,
    "1h4e": 2091,
    "3d3a": 2092,
    "3e6b": 2093,
    "3g7c+": 2094,
    "4a3a+": 2095,
    "4a5a+": 2096,
    "4d7d": 2097,
    "4e4g+": 2098,
    "4g7d": 2099,
    "5c4a+": 2100,
    "5c6e": 2101,
    "5d3b": 2102,
    "5f5a": 2103,
    "6a3a": 2104,
    "6a3d+": 2105,
    "6a5a+": 2106,
    "6e5c": 2107,
    "6e5g": 2108,
    "6f3f": 2109,
    "6g7i+": 2110,
    "7a7b+": 2111,
    "7d7g+": 2112,
    "7e7c+": 2113,
    "7f4c": 2114,
    "8c6e+": 2115,
    "8e8a+": 2116,
    "9a7a": 2117,
    "9e7g": 2118,
    "9i4d": 2119,
    "G*1d": 2120,
    "G*9e": 2121,
    "R*3g": 2122,
    "S*9i": 2123,
    "1f2d": 2124,
    "1h1f": 2125,
    "2g4e": 2126,
    "2g5d+": 2127,
    "2h2a+": 2128,
    "3h5f": 2129,
    "3i8i": 2130,
    "4a1a+": 2131,
    "4a4b+": 2132,
    "4d6d": 2133,
    "4f1c+": 2134,
    "4g2i": 2135,
    "4g6i+": 2136,
    "5a5f": 2137,
    "5c5e": 2138,
    "5d8g+": 2139,
    "5e5h": 2140,
    "6c5e": 2141,
    "6c6e": 2142,
    "6d2d": 2143,
    "6d4b+": 2144,
    "6e6i": 2145,
    "6g3d": 2146,
    "6g7e": 2147,
    "6h1c+": 2148,
    "7a3e+": 2149,
    "7a7e": 2150,
    "7b6a+": 2151,
    "7d5b+": 2152,
    "7d7b": 2153,
    "8b4f": 2154,
    "8b8i+": 2155,
    "8f2f": 2156,
    "9b7b": 2157,
    "9e9h+": 2158,
    "9f7d": 2159,
    "9i6i": 2160,
    "P*1i": 2161,
    "1i3i": 2162,
    "3a1a+": 2163,
    "3a3e": 2164,
    "3d3g+": 2165,
    "3d6g": 2166,
    "3f6c": 2167,
    "3g3i": 2168,
    "3g4h+": 2169,
    "4a6a+": 2170,
    "4b9g+": 2171,
    "4d4g+": 2172,
    "4e3c": 2173,
    "4i1i+": 2174,
    "5a7a": 2175,
    "5d5b+": 2176,
    "5d7b": 2177,
    "5f8c+": 2178,
    "6a9a": 2179,
    "6f4h+": 2180,
    "7e7h+": 2181,
    "7e9g": 2182,
    "7f7c+": 2183,
    "8f4b": 2184,
    "8f5i+": 2185,
    "8h4h": 2186,
    "9b4b": 2187,
    "R*7g": 2188,
    "1d3d": 2189,
    "1e3g": 2190,
    "1h3f": 2191,
    "1h6h": 2192,
    "2f1h+": 2193,
    "2f2h+": 2194,
    "2g4e+": 2195,
    "3a1c": 2196,
    "4a3c": 2197,
    "4d4b": 2198,
    "4d6b+": 2199,
    "4e4c": 2200,
    "4e4h": 2201,
    "4e6g": 2202,
    "4e8e": 2203,
    "5b4a+": 2204,
    "5e8e": 2205,
    "5g4h+": 2206,
    "6e6b": 2207,
    "6f6h+": 2208,
    "7b5d+": 2209,
    "7c8d+": 2210,
    "7e7h": 2211,
    "7e9c": 2212,
    "8b5b+": 2213,
    "8e8i+": 2214,
    "8i7i+": 2215,
    "8i8d": 2216,
    "9d7f": 2217,
    "9e6h": 2218,
    "9f9d": 2219,
    "9i7i": 2220,
    "G*1f": 2221,
    "G*9d": 2222,
    "1e4b": 2223,
    "2a5d": 2224,
    "2e2h+": 2225,
    "2f1g+": 2226,
    "2f5c": 2227,
    "2g1i+": 2228,
    "3a7a": 2229,
    "3g3e": 2230,
    "4a1a": 2231,
    "4d1a": 2232,
    "4f7c": 2233,
    "4i4h+": 2234,
    "4i8i": 2235,
    "5c4e": 2236,
    "5h1h": 2237,
    "6a6b+": 2238,
    "6b3b": 2239,
    "6c6f": 2240,
    "6d2h+": 2241,
    "6d8b+": 2242,
    "6f3c": 2243,
    "6f8h+": 2244,
    "7b5d": 2245,
    "7c1i+": 2246,
    "7c7e": 2247,
    "7e3e": 2248,
    "7f7i+": 2249,
    "7g9i": 2250,
    "7i8g": 2251,
    "8c6a+": 2252,
    "8c7a+": 2253,
    "8d5a+": 2254,
    "8d8i": 2255,
    "8f5c": 2256,
    "8i8e": 2257,
    "9a3a": 2258,
    "9b5f": 2259,
    "9c7e": 2260,
    "9h8i+": 2261,
    "1a7g": 2262,
    "1f4f": 2263,
    "2c4c": 2264,
    "2e2b+": 2265,
    "2i5f": 2266,
    "3b7b": 2267,
    "3c4d+": 2268,
    "3f3b+": 2269,
    "3f6i": 2270,
    "3h5f+": 2271,
    "4a4f": 2272,
    "4a7d+": 2273,
    "4c3e": 2274,
    "4c5e": 2275,
    "4d7a+": 2276,
    "4e2c+": 2277,
    "4e6c+": 2278,
    "4e7e": 2279,
    "4f2h+": 2280,
    "4g2e": 2281,
    "4h3i+": 2282,
    "4h5i+": 2283,
    "5e2h": 2284,
    "5e2h+": 2285,
    "5f7h+": 2286,
    "5g4e": 2287,
    "5h3f": 2288,
    "6a6d+": 2289,
    "6c8a": 2290,
    "6d6b": 2291,
    "6e4g": 2292,
    "6f2f": 2293,
    "6f4f": 2294,
    "6g4i": 2295,
    "7e5g+": 2296,
    "7g7i": 2297,
    "8a7b+": 2298,
    "8c6e": 2299,
    "8g8e": 2300,
    "8i3i": 2301,
    "9a4f": 2302,
    "9b7d": 2303,
    "9e9i+": 2304,
    "1b1e": 2305,
    "1c1e": 2306,
    "1e2g+": 2307,
    "2a2b+": 2308,
    "2a2e": 2309,
    "2d5a+": 2310,
    "2g2c+": 2311,
    "3d5b": 2312,
    "3e3g+": 2313,
    "3e3h+": 2314,
    "3f3c+": 2315,
    "3g1i+": 2316,
    "3i3d": 2317,
    "3i3g+": 2318,
    "3i8d+": 2319,
    "4b4g+": 2320,
    "4d1g+": 2321,
    "4d8d": 2322,
    "4e4i+": 2323,
    "4g2i+": 2324,
    "4g5e": 2325,
    "4h4c+": 2326,
    "4h8d": 2327,
    "5a3c+": 2328,
    "5b9b": 2329,
    "5f1f": 2330,
    "5h6i+": 2331,
    "5i2f+": 2332,
    "5i9e": 2333,
    "6b7d": 2334,
    "6d9g": 2335,
    "6i6h+": 2336,
    "7c6a+": 2337,
    "7c9a+": 2338,
    "7d5b": 2339,
    "7f5h+": 2340,
    "7f7b": 2341,
    "8a5d": 2342,
    "8d8i+": 2343,
    "8d9b+": 2344,
    "8g8d": 2345,
    "8h7i+": 2346,
    "8i5f": 2347,
    "9g9e": 2348,
    "R*6f": 2349,
    "R*8f": 2350,
    "S*9a": 2351,
    "1d2c+": 2352,
    "1d3f": 2353,
    "1e4h+": 2354,
    "1h1d": 2355,
    "1h5d": 2356,
    "1i7i": 2357,
    "2b7b": 2358,
    "2d2i+": 2359,
    "2e2g+": 2360,
    "2e4g+": 2361,
    "2h2b+": 2362,
    "2h2d+": 2363,
    "2h6d": 2364,
    "3a4a+": 2365,
    "3c2d+": 2366,
    "3d3h": 2367,
    "3e6b+": 2368,
    "4a4c+": 2369,
    "4b1b": 2370,
    "4d4b+": 2371,
    "4f1c": 2372,
    "4g6e+": 2373,
    "4g8c+": 2374,
    "4i6g": 2375,
    "4i6i+": 2376,
    "5a5g+": 2377,
    "5a9a": 2378,
    "5e5g": 2379,
    "5e8b+": 2380,
    "5h4i+": 2381,
    "5i1i": 2382,
    "5i5c+": 2383,
    "5i7g+": 2384,
    "6c8a+": 2385,
    "6e3e": 2386,
    "7a7c+": 2387,
    "7c7f": 2388,
    "7e4b+": 2389,
    "7e7c": 2390,
    "7i9i": 2391,
    "8c5f+": 2392,
    "8d9c+": 2393,
    "8h8e": 2394,
    "9b6e": 2395,
    "9g5c+": 2396,
    "P*9a": 2397,
    "1b3b": 2398,
    "1d2b+": 2399,
    "1f1d": 2400,
    "1f3f": 2401,
    "2c5f": 2402,
    "2g2i+": 2403,
    "2g3e": 2404,
    "3a1a": 2405,
    "3a2c": 2406,
    "3a3b+": 2407,
    "3b5d": 2408,
    "4c6a+": 2409,
    "4e4a": 2410,
    "4e4h+": 2411,
    "4f8b+": 2412,
    "4g3i+": 2413,
    "5a4a+": 2414,
    "5a8a+": 2415,
    "5b7d": 2416,
    "5d3b+": 2417,
    "5g6i+": 2418,
    "5h5c+": 2419,
    "5h7f": 2420,
    "5i1e": 2421,
    "6a4c": 2422,
    "6e4e": 2423,
    "6f6a+": 2424,
    "7d9b": 2425,
    "7f9d": 2426,
    "7h3h": 2427,
    "7h5f": 2428,
    "8d6b+": 2429,
    "8g6g": 2430,
    "9e6b+": 2431,
    "9f8g+": 2432,
    "N*9h": 2433,
    "1a6a": 2434,
    "1f3h": 2435,
    "1g5c+": 2436,
    "1h7h": 2437,
    "2c5c": 2438,
    "2e2b": 2439,
    "2h2e+": 2440,
    "2i2e+": 2441,
    "2i2h+": 2442,
    "2i4i+": 2443,
    "3b8b": 2444,
    "3c4b+": 2445,
    "3c7g": 2446,
    "3d5b+": 2447,
    "3g5e+": 2448,
    "3i3c+": 2449,
    "3i4i+": 2450,
    "4a5c": 2451,
    "4b3a+": 2452,
    "4c5a+": 2453,
    "4e2c": 2454,
    "4e6g+": 2455,
    "5b3d": 2456,
    "5e5b": 2457,
    "5f5b+": 2458,
    "5i5g+": 2459,
    "6a6c+": 2460,
    "6a6f": 2461,
    "6c4c": 2462,
    "6c8c": 2463,
    "6e4c": 2464,
    "6e7c": 2465,
    "6e8g+": 2466,
    "6f3i+": 2467,
    "6i9i+": 2468,
    "7a2f+": 2469,
    "7a9a": 2470,
    "7c8b+": 2471,
    "7e4h": 2472,
    "7g7e": 2473,
    "7g8f+": 2474,
    "7h4e": 2475,
    "8b8h+": 2476,
    "8c8a+": 2477,
    "8d8h": 2478,
    "8e7c": 2479,
    "8f9d": 2480,
    "8f9h+": 2481,
    "9d9g+": 2482,
    "9e7c": 2483,
    "9f9c+": 2484,
    "9i3c": 2485,
    "1f5f": 2486,
    "1g1d": 2487,
    "2e3g": 2488,
    "2e4g": 2489,
    "2f5i+": 2490,
    "2f7a+": 2491,
    "2g5g": 2492,
    "2i2b+": 2493,
    "2i3i+": 2494,
    "2i6e": 2495,
    "3a6d+": 2496,
    "3b1b": 2497,
    "3d3g": 2498,
    "3d3i": 2499,
    "3e2c": 2500,
    "3f3h+": 2501,
    "3f5h+": 2502,
    "3g4i+": 2503,
    "3i1g": 2504,
    "4a4g+": 2505,
    "4c2c": 2506,
    "4e4g": 2507,
    "5a2d+": 2508,
    "5a4c": 2509,
    "5c7e+": 2510,
    "5g7e+": 2511,
    "5i2i+": 2512,
    "6a2a": 2513,
    "6e4g+": 2514,
    "6f6h": 2515,
    "6g6d": 2516,
    "6i3f": 2517,
    "6i7i+": 2518,
    "7a6c": 2519,
    "7b3b": 2520,
    "7d7b+": 2521,
    "7d9f": 2522,
    "7g5g": 2523,
    "7g6i+": 2524,
    "7i3i": 2525,
    "7i5g+": 2526,
    "8a6a+": 2527,
    "8a7a+": 2528,
    "8d4h+": 2529,
    "8e6c": 2530,
    "8e8b+": 2531,
    "8e8h+": 2532,
    "8f8a+": 2533,
    "8f8b+": 2534,
    "8f9g+": 2535,
    "8g9i+": 2536,
    "8h3h": 2537,
    "9c9f": 2538,
    "9d7d": 2539,
    "9e9b+": 2540,
    "9i2i": 2541,
    "B*9a": 2542,
    "R*9d": 2543,
    "1e1i+": 2544,
    "2c4a": 2545,
    "2d1b+": 2546,
    "2d7i+": 2547,
    "2f2b+": 2548,
    "2h4f+": 2549,
    "3c3e": 2550,
    "3e3a+": 2551,
    "3g2i+": 2552,
    "3i3h+": 2553,
    "4a6c": 2554,
    "4d4a+": 2555,
    "4e5g": 2556,
    "4g4i+": 2557,
    "4g6g": 2558,
    "4h1e": 2559,
    "4i9i": 2560,
    "5a1e": 2561,
    "5c9g+": 2562,
    "5d2g": 2563,
    "5e8b": 2564,
    "5i8i+": 2565,
    "6a8c": 2566,
    "6e3b+": 2567,
    "6e6b+": 2568,
    "6e6c": 2569,
    "7a3a": 2570,
    "7a3e": 2571,
    "7a5a+": 2572,
    "7a7d+": 2573,
    "7a7f": 2574,
    "7d4g": 2575,
    "7d7a+": 2576,
    "7d7h+": 2577,
    "7g8h+": 2578,
    "7i9i+": 2579,
    "8b6d+": 2580,
    "8b7a+": 2581,
    "8b8d+": 2582,
    "8e9g": 2583,
    "8g7i+": 2584,
    "8g8b": 2585,
    "9d8b+": 2586,
    "9e5a+": 2587,
    "9f6c+": 2588,
    "N*9b": 2589,
    "1a2b+": 2590,
    "1a5a": 2591,
    "1b2a+": 2592,
    "1d4g+": 2593,
    "1f1c+": 2594,
    "1f4c+": 2595,
    "2c1a+": 2596,
    "2c4e": 2597,
    "2f2a": 2598,
    "2f2b": 2599,
    "2h3h+": 2600,
    "3b4a+": 2601,
    "3d2f": 2602,
    "3e7a": 2603,
    "3e7i": 2604,
    "3f3b": 2605,
    "3f3i+": 2606,
    "3g5g": 2607,
    "3h3g+": 2608,
    "4b5a+": 2609,
    "4c4f": 2610,
    "4e3g": 2611,
    "4f1i": 2612,
    "4f4b": 2613,
    "4h8h": 2614,
    "4i4c+": 2615,
    "4i5i+": 2616,
    "5c1g+": 2617,
    "5c5f": 2618,
    "5c8f+": 2619,
    "5d5h+": 2620,
    "5e5b+": 2621,
    "5g7i+": 2622,
    "5i5f+": 2623,
    "6a3d": 2624,
    "6b2b": 2625,
    "6e2a+": 2626,
    "6e3h": 2627,
    "6e8c": 2628,
    "6g8i": 2629,
    "6h6a+": 2630,
    "6i6f+": 2631,
    "7a2a": 2632,
    "7d4a": 2633,
    "7e7b+": 2634,
    "7f3b": 2635,
    "7g3c": 2636,
    "7g6h+": 2637,
    "7h6i+": 2638,
    "7i7d": 2639,
    "8a8e+": 2640,
    "8a8h+": 2641,
    "8b4b+": 2642,
    "8b6b+": 2643,
    "8c9d+": 2644,
    "8e4a": 2645,
    "8e8i": 2646,
    "8f6h+": 2647,
    "8g6e": 2648,
    "8h6f+": 2649,
    "9c7a": 2650,
    "9c9a": 2651,
    "9e7g+": 2652,
    "N*1b": 2653,
    "R*9g": 2654,
    "1a7a": 2655,
    "1b2c+": 2656,
    "1b3d": 2657,
    "1d1g+": 2658,
    "2a1b+": 2659,
    "2a2f": 2660,
    "2b3a+": 2661,
    "2b3b+": 2662,
    "2c2i": 2663,
    "2d1c+": 2664,
    "2g1h+": 2665,
    "2h2f+": 2666,
    "2h3i+": 2667,
    "2h4h+": 2668,
    "3a4c": 2669,
    "3c3f": 2670,
    "3d3a+": 2671,
    "3e1c": 2672,
    "3e3b": 2673,
    "3e3g": 2674,
    "3f6i+": 2675,
    "3g3d": 2676,
    "3g6d+": 2677,
    "3h3c+": 2678,
    "3h4f": 2679,
    "3h6e": 2680,
    "4a4d+": 2681,
    "4a8a+": 2682,
    "4b3d": 2683,
    "4e4b": 2684,
    "4f1f": 2685,
    "4g2g": 2686,
    "4h3f": 2687,
    "5b6d": 2688,
    "5e1a": 2689,
    "5f5c": 2690,
    "5f8c": 2691,
    "5g3e+": 2692,
    "5g3g": 2693,
    "5h4f": 2694,
    "5i5h+": 2695,
    "5i8f+": 2696,
    "6b2f": 2697,
    "6b4d+": 2698,
    "6c6a+": 2699,
    "6e8g": 2700,
    "6f6i+": 2701,
    "6g4i+": 2702,
    "6g8i+": 2703,
    "6h7f": 2704,
    "6i9i": 2705,
    "7b4e": 2706,
    "7c5e+": 2707,
    "7c7g+": 2708,
    "7c9a": 2709,
    "7e4h+": 2710,
    "7f4c+": 2711,
    "7h7c+": 2712,
    "7i1i": 2713,
    "7i6g": 2714,
    "7i7e": 2715,
    "8a2a+": 2716,
    "8b7b+": 2717,
    "8c9e": 2718,
    "8d3i+": 2719,
    "8d8g": 2720,
    "8e5b": 2721,
    "9d9b": 2722,
    "9d9b+": 2723,
    "9e5i": 2724,
    "9e8c+": 2725,
    "9i4i": 2726,
    "1b1g+": 2727,
    "1c1f": 2728,
    "1e4h": 2729,
    "1e5i+": 2730,
    "1f1h+": 2731,
    "2a2c+": 2732,
    "2a6a+": 2733,
    "2g2e+": 2734,
    "2h6h+": 2735,
    "2i3h+": 2736,
    "3a3c+": 2737,
    "3a9a": 2738,
    "3c2b+": 2739,
    "3c5c": 2740,
    "3e3c": 2741,
    "3g2h+": 2742,
    "3g3c+": 2743,
    "3h2f": 2744,
    "3h5h+": 2745,
    "3i5i+": 2746,
    "3i8i+": 2747,
    "4a7a+": 2748,
    "4c6e+": 2749,
    "4d4i": 2750,
    "4e2g": 2751,
    "4f4c": 2752,
    "4f7i+": 2753,
    "4g4c+": 2754,
    "4i3i+": 2755,
    "4i8i+": 2756,
    "5a2a+": 2757,
    "5c3e+": 2758,
    "5c5g+": 2759,
    "5d7b+": 2760,
    "5f2c": 2761,
    "5f5i+": 2762,
    "5g3i+": 2763,
    "5g5c+": 2764,
    "5g8d+": 2765,
    "5i3i+": 2766,
    "5i4i+": 2767,
    "5i6i+": 2768,
    "5i9i": 2769,
    "6a7c": 2770,
    "6b5d": 2771,
    "6b9e": 2772,
    "6c5a+": 2773,
    "6c7a+": 2774,
    "6e6g": 2775,
    "6g5e": 2776,
    "6g5i+": 2777,
    "6g8e": 2778,
    "6h6c+": 2779,
    "6i2i+": 2780,
    "6i5g": 2781,
    "6i6g+": 2782,
    "7a6a+": 2783,
    "7a9c": 2784,
    "7b4e+": 2785,
    "7b7g+": 2786,
    "7c6b+": 2787,
    "7c8a+": 2788,
    "7e7g": 2789,
    "7e9c+": 2790,
    "7e9g+": 2791,
    "7g7d": 2792,
    "7h2h": 2793,
    "7i6i+": 2794,
    "7i7h+": 2795,
    "8e8h": 2796,
